   CC.SORT.DATA(AC626020) - 01.01                  Columns 00001 00072 
===>                                                  Scroll ===> CSR  
**************************** Top of Data ******************************
SORT  FIELDS=(1,9,CH,A)                                                
SUM   FIELDS=NONE                                                      
*************************** Bottom of Data ****************************
