    CC.SORT.DATA(AC625020) - 01.01                  Columns 00001 00072 
 ===>                                                  Scroll ===> CSR  
***************************** Top of Data ******************************
 SORT FIELDS=(01,11,CH,A)                                               
**************************** Bottom of Data ****************************
