    CC.SORT.DATA(AC630040) - 01.00                  Columns 00001 00072 
 ===>                                                  Scroll ===> CSR  
***************************** Top of Data ******************************
 SORT FIELDS=(01,15,CH,A)                                               
**************************** Bottom of Data ****************************
