IDENTIFICATION DIVISION.

PROGRAM-ID.     CCAC6320.
000400*TRANSLATED BY MHTRAN-2  1/12/96                                  00040001

AUTHOR.         J. ZYCH .
DATE-WRITTEN.   OCTOBER, 1994
DATE-COMPILED.
000900***************************************************************** 00090001
001000*REMARKS.                                                       * 00100001
001100*                                                               * 00110001
001200*   THIS PROGRAM READS DATA FROM THE FOLLOWING SOURCES:         * 00120001
001300*       B&CCW ISSUES                                            * 00130001
001400*       REACT - REMOVED MAY 2005                                * 00140001
001500*       1099 MISCELLANEOUS INPUT-FORM 20071                     * 00150001
001600*       INSURANCE MANUAL ISSUES - REMOVED MAY 2004              * 00160001
001700*       COMPASS (FUTURE ENHANCEMENT)                            * 00170001
001800*       PREVIOUSLY REJECT TRANSACTIONS                          * 00180001
001900*   AND DETERMINES THE TRANSACTIONS THAT ARE 1099 REPORTABLE.   * 00190001
002000*   DATA WHICH PASSES THE EDITS IS REPORTED IN A TRANSACTION    * 00200001
002100*   RECORD.  DATA WHICH DOES NOT PASS THE EDITS AND FOREIGN     * 00210001
002200*   TRANSACTIONS ARE WRITTEN TO SEPARATE, INDIVIDUAL FILES.     * 00220001
002300*   REJECT TRANSACTIONS ARE ALSO FORMATTED TO A SECOND REJECT   * 00230001
002400*   FILE FOR REPORTING PURPOSES.                                * 00240001
002500*                                                               * 00250001
002600*   TRANSACTIONS WHICH DO NOT MEET THE CRITERIA FOR 1099        * 00260001
002700*   REPORTING ARE WRITTEN TO AN "EXCLUDES" FILE.                * 00270001
002800*                                                               * 00280001
002900*   SUCCESSFULLY EDITED TRANSACTIONS ARE PASSED DOWNSTREAM TO A * 00290001
003000*   MASTER UPDATE PROGRAM WHICH UPDATES A MASTER FILE.          * 00300001
003100***************************************************************** 00310001
003200****              PROGRAM MODIFICATION HISTORY                  * 00320001
003300***************************************************************** 00330001
003400**  LEVEL *   DATE    *   MODIFIED BY *          DESCRIPTION    * 00340001
003500***************************************************************** 00350001
003600**   1    * 10/XX/94  * J. ZYCH       * (930526) INITIAL PROGRAM* 00360001
003700**        *           *               *           LOAD.         * 00370001
003800**   2    *  4/20/95  * J. ZYCH       * ADD PQ TO PROV TABLE    * 00380001
003900**   3-9  *  4/21/95  * J. ZYCH       * ADD INS REJECT PROCESS  * 00390001
004000**        *           *               *                         * 00400001
004100**        *  5/15/95  * J. WATSON     * SEARCH ENTRY CODE TABLE * 00410001
004200**        *           *               * FOR AIS B&CCW RECORDS   * 00420001
004300**        *           *               * (CHANGED PAR. 5215)     * 00430001
004400**        *  1/24/97  * A. MESSING    * CHANGE AIS B&CCW RECORDS* 00440001
004500**        *           *               * TO INCLUDE CHECK NUMBER * 00450001
004600**        *           *               * IN CHECK NUM KEY        * 00460001
004700**        *  3/17/97  * A. MESSING    * CHANGE INSERTED TO LIMIT* 00470001
004800**        *           *               * THE WS-T01W-NBR-DIST-RCD* 00480001
004900**        *           *               * TO 5.                   * 00490001
005000**        *           *               *                         * 00500001
005100**        *  3/31/00  * T. MURAWSKI   * CHG NAME AND ADDRESS    * 00510001
005200**        *           *               * FORMAT IN TEN99 RECORD. * 00520001
005300**        *           *               *                         * 00530001
005400**        *           *               * DELETE CODE FOR OLD     * 00540001
005500**        *           *               * MARS B&CCW FILE.        * 00550001
005600**        *           *               *                         * 00560001
005700**        *           *               * EDIT SSN                * 00570001
005800**        *           *               *                         * 00580001
005900**        * 01/31/02  * JOHN GORSKI   * CORRECTED 13TH MONTH    * 00590001
006000**        *           *               * LOGIC WHEN FIX DONE TO  * 00600001
006100**        *           *               * REJECT FILE TO A MANUAL * 00610001
006200**        *           *               * INSURANCE RECORD. SEE   * 00620001
006300**        *           *               * PARAGRAPH 5130.         * 00630001
006400**        *           *               *                         * 00640001
006500**        * 01/31/02  * RICK FORTUNATE* CORRECTED REJECTS FROM  * 00650001
006600**        *           *               * REACT WHEN POSTING TO   * 00660001
006700**        *           *               * THE TRANSACTION (OK)    * 00670001
006800**        *           *               * FILES. POS 1-6 POPULATED* 00680001
006900**        *           *               * WITH CHECK NUMBER. PARA * 00690001
007000**        *           *               * 5520-REJ-CYCLE-EDIT.    * 00700001
007100**        * 04/01/03  * CH.SUDHEER    * CHANGED 'PQ' TO 'QC' AND* 00710001
007200**        *           *               * CHANGED 'NF' TO 'NL' IN * 00720001
007300**        *           *               * THE CANADIAN PROVINCE   * 00730001
007400**        *           *               * CONVERSION TABLE.       * 00740001
007500**        * 01/08/04  * DAVE OPPERMANN* RENAMED PROGRAM FROM    * 00750001
007600**        *           *               * CCAC6320                * 00760001
007700**EPM#    * 11/11/04  * CH.SUDHEER    * RENAMED ACCOUNTING UNIT * 00770001
007800**1371    *           *               * TO BUSINESS UNIT AND    * 00780001
007900**        *           *               * INCREASED THE LENGTH OF * 00790001
008000**        *           *               * THE FIELD FROM 4 TO 5   * 00800001
008100**        *           *               * BYTES.ALSO REMOVED THE  * 00810001
008200**        *           *               * LETTERS AIS.            * 00820001
008300**EPM#    * 05/19/05  * DAVE OPPERMANN* REMOVED ISSURANCE ISSUES* 00830001
008400**1371    *           *               * AND REACT FILE INPUTS   * 00840001
008500**        *           *               * FROM PROGRAM.           * 00850001
008600**EPM#    * 03/06/07  * JOY MADDEN    * CR 2007-ACC-010 REMOVE  * 00860001
008700**2182    *           *               * BRANCH LOGIC USED TO    * 00870001
008800**        *           *               * DETERMINE COUNTRY. ALSO * 00880001
008900**        *           *               * CLEANUP UNUSED WORKING  * 00890001
009000**        *           *               * STORAGE AND REMOVE DEAD * 00900001
009100**        *           *               * CODE FOR REACT AND INS  * 00910001
009200**        *           *               * FILE PROCESSING.        * 00920001
009300**2007-ACC* 06/05/08  * A. DOBRYNSKI  * ADD DEFT 1099 FILE      * 00930001
009400**086     *           *               * REMOVE OBSOLETE REACT   * 00940001
009500**        *           *               * LOGIC. RENAME REACT     * 00950001
009600**        *           *               * 1099 ENTRY TABLE TO     * 00960001
009700**        *           *               * 1099 ENTRY CODE TABLE.  * 00970001
009800**2008-ACC* 08/06/08  * D. OPPERMANN  * CANADIAN 1099 MISC FILES* 00980001
009900**044     *           *               * MAINTENANCE.            * 00990001
010000**        *           *               * ADD LOGIC TO MOVE       * 01000001
010100**        *           *               * CANADIAN ACCOUNTS TO    * 01010001
010200**        *           *               * THE FOREIGN FILE.       * 01020001
010300**EPM 2658* 06/04/10  * R. FORTUNATE  * CANADIAN TAX RESTRUCTURE* 00980001
010400**        *           *               * ADD CAN OPLOC 3798 TO   * 01000001
010500**        *           *               * CANADIAN-OP-LOC.        * 01010001
010600**        *           *               * - USED TO IDENTIFY RECS * 01020001
010700**        *           *               *   TO BE WRITTEN TO THE  * 01020001
010800**        *           *               *   FOREIGN FILE.         * 01020001
010900**        *           *               *   REPLACES OPLOC 3337   * 01020001
011000**2010-ACC* 06/04/10  * R. FORTUNATE  * ADD 2 NEW 1099          * 00980001
011100**023     *           *               * REPORTABLE ENTRY CODES  * 01000001
011200**        *           *               * - 663 AND 669           * 01010001
011300**2010-ACC* 06/04/10  * R. FORTUNATE  * UPDATES TO THE 1099     * 01020001
011400**030     *           *               * REPORTABLE ENTRY CODES  * 01020001
011500**        *           *               * TABLE - INCREASED THE   * 01020001
011600**        *           *               * TABLE TO 100. TABLE LOAD* 01020001
011700**        *           *               * STOPPED WHEN REPORTABLE * 01020001
011800**        *           *               * ENTRY CODE = HIGH VALUES* 01020001
011900**EPM 2666* 01/03/11  * R. FORTUNATE  * ADD TAX TYPE AND TIN TO * 01020001
012000**        *           *               * THE TRANSACTION UPDATE  * 01020001
012100**        *           *               * FILE FOR THE 1099 MASTER* 01020001
012200**        *           *               * KEY => CHECK NUMBER, TAX* 01020001
012300**        *           *               * TYPE, & TIN             * 01020001
012400**        *           *               *                         * 01020001
012500**ET      * 05/04/12  * R. FORTUNATE  * CORRECT TAX TYPE & TIN  * 01020001
012600**11126623*           *               * FROM THE REJ/RECYCLE    * 01020001
012700**SUPPORT *           *               * FILE FOR THE TRANSACTION* 01020001
012800**LOG     *           *               * UPDATE KEY =>CHECK NUM, * 01020001
012900**        *           *               * TAX TYPE, & TIN         * 01020001
013000**        *           *               *                         * 01020001
013100**2013-ACC* 11/01/13  * R. FORTUNATE  * CHANGE CLOC CCW CHECK   * 01020001
013200**-132    *           *               * BRANCH FROM 095 TO 048. * 01020001
013300**        *           *               * BRANCH USED TO IDENTIFY * 01020001
013400**        *           *               * CLOC CHECKS. NOT ALL BR * 01020001
013500**        *           *               * 048 CLOC CHECKS. CLOC   * 01020001
013600**        *           *               * CHECKS CONTAIN TAX ID.  * 01020001
013700**        *           *               * ET 12215426             * 01020001
013800**        *           *                                         * 00370001
013900**2018-ACC* 04/13/2018* R. FORTUNATE  *ADD NEW CEC (ENTRY CODES)* 00530000
014000**-043                                 INCREASE 1099 TABLE FROM * 00540000
014100*                                      100 TO 150               * 00540000
014200*                                                               * 00540000
014300***************************************************************** 01030001


     EJECT
ENVIRONMENT DIVISION.

CONFIGURATION SECTION.

SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.

INPUT-OUTPUT SECTION.

FILE-CONTROL.
    SELECT TEN99-T01R-MISC-TRANS-FILE
        ASSIGN TO UT-S-CCACT01R.
    SELECT TEN99-T03R-BCCW-FILE
        ASSIGN TO UT-S-CCACT03R.
    SELECT TEN99-T04R-DEFT-FILE
        ASSIGN TO UT-S-CCACT04R.
    SELECT TEN99-T05R-REJ-CYCLE-FILE
        ASSIGN TO UT-S-CCACT05R.
    SELECT WS-T07R-1099ENTRY-CD-FILE
        ASSIGN TO UT-S-CCACT07R.
    SELECT TEN99-T01W-TRANS-OUTPUT-FILE
        ASSIGN TO UT-S-CCACT01W.
    SELECT TEN99-T02W-REJ-CYCLE-OUT-FILE
        ASSIGN TO UT-S-CCACT02W.
    SELECT TEN99-C01W-REJ-RPT-OUTPUT-FILE
        ASSIGN TO UT-S-CCACC01W.
    SELECT TEN99-T03W-FOREIGN-OUTPUT-FILE
        ASSIGN TO UT-S-CCACT03W.
    SELECT TEN99-T04W-EXCLUDES-FILE
        ASSIGN TO UT-S-CCACT04W.
    SELECT CC-R01R-CONTROL-CARD
        ASSIGN TO UT-S-CCACR01R.
017900***************************************************************** 01390001
018000*    ++INCLUDE C2INX01                                          * 01400001
018100*      COMMON SYSOUT FILE CONTROL SECTION                       * 01410001
018200***************************************************************** 01420001
COPY C2INX001.
    EJECT
DATA DIVISION.

FILE SECTION.

018900***************************************************************** 01490001
019000*      INPUT FILES                                              * 01500001
019100*      MISCELLANEOUS INPUT--FORM #20071                         * 01510001
019200***************************************************************** 01520001

FD  TEN99-T01R-MISC-TRANS-FILE
    BLOCK CONTAINS 0 RECORDS
    RECORDING MODE IS F
    RECORD CONTAINS 320 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T01R-MISC-FORM-RCD                  PIC X(320).

020200***************************************************************** 01620001
020300*      NEW B&CCW ISSUES                                         * 01630001
020400***************************************************************** 01640001

FD  TEN99-T03R-BCCW-FILE
    BLOCK CONTAINS 0 RECORDS
    RECORDING MODE IS F
    RECORD CONTAINS 320 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T03R-BCCW-RCD                  PIC X(320).


EJECT
021600***************************************************************** 01760001
021700*      DEFT ISSUES                                              * 01770001
021800***************************************************************** 01780001

FD  TEN99-T04R-DEFT-FILE
    BLOCK CONTAINS 0 RECORDS
    RECORDING MODE IS F
    RECORD CONTAINS 320 CHARACTERS
    LABEL RECORDS STANDARD.

01  TEN99-T04R-DEFT-RCD                  PIC X(320).


EJECT
023000***************************************************************** 01900001
023100*      REJECT CYCLING ISSUES                                    * 01910001
023200***************************************************************** 01920001

FD  TEN99-T05R-REJ-CYCLE-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 526 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T05R-REJ-CYCLE-RCD            PIC X(526).

024200***************************************************************** 02020001
024300*      CONTROL CARD                                             * 02030001
024400***************************************************************** 02040001

FD  CC-R01R-CONTROL-CARD
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 80 CHARACTERS
    LABEL RECORDS STANDARD       .

01  CC-R01R-CONTROL-CARD-REC         PIC X(80).

025400***************************************************************** 02140001
025500*      REACT 1099 CODE TABLE                                    * 02150001
025600***************************************************************** 02160001

FD  WS-T07R-1099ENTRY-CD-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 80 CHARACTERS
    LABEL RECORDS STANDARD       .

01  WS-T07R-1099ENTRY-CD-RCD        PIC X(80).


026700***************************************************************** 02270001
026800*      TRANSACTION OUTPUT                                       * 02280001
026900***************************************************************** 02290001

FD  TEN99-T01W-TRANS-OUTPUT-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 450 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T01W-TRANS-OUTPUT-RCD                 PIC X(450).

EJECT
028000***************************************************************** 02400001
028100*      REJECT RECYCLING OUTPUT FILE                             * 02410001
028200***************************************************************** 02420001

FD  TEN99-T02W-REJ-CYCLE-OUT-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 526 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T02W-REJ-CYCLE-OUT-RCD         PIC X(526).


029300***************************************************************** 02530001
029400*      REJECT REPORT OUTPUT FILE--TO CREATE REJECT REPORT       * 02540001
029500***************************************************************** 02550001

FD  TEN99-C01W-REJ-RPT-OUTPUT-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 425 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-C01W-REJ-RPT-OUTPUT-RCD      PIC X(425).


030600***************************************************************** 02660001
030700*      FOREIGN OUTPUT FILE                                      * 02670001
030800***************************************************************** 02680001

FD  TEN99-T03W-FOREIGN-OUTPUT-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 450 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T03W-FOREIGN-OUTPUT-RCD     PIC X(450).

031800***************************************************************** 02780001
031900*      EXCLUDED OUTPUT FILE (TRANSACTIONS W/O SSN               * 02790001
032000*      OR TRANSACTIONS WITH $0 1099 AMOUNT.                     * 02800001
032100***************************************************************** 02810001

FD  TEN99-T04W-EXCLUDES-FILE
    RECORDING MODE IS F
    BLOCK CONTAINS 0 CHARACTERS
    RECORD CONTAINS 450 CHARACTERS
    LABEL RECORDS STANDARD        .

01  TEN99-T04W-EXCLUDES-RCD          PIC X(450).

EJECT
033200***************************************************************** 02920001
033300*    ++INCLUDE C2INX002                                         * 02930001
033400*      COMMON SYSOUT FILE DEFINITION SECTION                    * 02940001
033500***************************************************************** 02950001
COPY C2INX002.


EJECT
WORKING-STORAGE SECTION.
77  PAN-VALET PICTURE X(24) VALUE '024CCAC6320  05/19/05'.
034200***************************************************************** 03020001
034300*  INPUT/OUTPUT FILE AND RECORD LAYOUTS                         * 03030001
034400*      READ AREA FOR MISC FORM INPUT                            * 03040001
034500***************************************************************** 03050001
034600
01  PUPS2000.
034800*
    05  FILLER                  PIC X(69)   VALUE
        "PUPS2000 FORTUNATE, R. J. (RICHARD)     13ACC132 2013110
035100-        "1083813961986".
035200
01  WS-T01R-MISC-FORM-RCD.
    05   WS-T01R-MISC-FORM-OPER-LOC         PIC X(4).
    05   WS-T01R-MISC-FORM-1099-TYPE        PIC X.
    05   WS-T01R-MISC-FORM-SSN              PIC X(9).
    05   WS-T01R-MISC-FORM-REFERENCE        PIC X(11).
    05   WS-T01R-MISC-FORM-AMT              PIC 9(8)V99.
    05   WS-T01R-MISC-FORM-PAY-YY           PIC XX.
    05   WS-T01R-MISC-FORM-NAME.
         10   WS-T01R-MISC-FORM-NAME-LAST   PIC X(38).
         10   WS-T01R-MISC-FORM-NAME-FI     PIC X.
         10   WS-T01R-MISC-FORM-NAME-MI     PIC X.
    05   FILLER                             PIC XXX.
    05   WS-T01R-MISC-FORM-ADDR-1           PIC X(37).
    05   WS-T01R-MISC-FORM-ADDR-2           PIC X(43).
    05   WS-T01R-MISC-FORM-CITY             PIC X(27).
    05   WS-T01R-MISC-FORM-STATE            PIC XX.
    05   WS-T01R-MISC-FORM-POSTCODE         PIC X(9).
    05   WS-T01R-MISC-FORM-BRANCH           PIC X(3).
    05   WS-T01R-MISC-FORM-DESCRIPTION      PIC X(40).
    05   WS-T01R-MISC-FORM-AMT-IND          PIC X.
    05   WS-T01R-MISC-FORM-SSN-IND          PIC X.
    05   FILLER                             PIC X(9).
    05   WS-T01R-MISC-FORM-TRANS-CODE       PIC X.
    05   FILLER                             PIC X(64).
    05   WS-T01R-MISC-FORM-TAX-TYPE         PIC X(1).
         88 WS-T01R-MISC-FORM-VALID-TAX            VALUE "3" "7".
    05   WS-T01R-MISC-FORM-TIN-IND          PIC X(1).
    05   FILLER                             PIC X(1).

01  WS-T01R-MISC-FORM-HDR REDEFINES WS-T01R-MISC-FORM-RCD.
    05   WS-T01R-MISC-FORM-HDR-VALUE        PIC X(10).
    05   FILLER                             PIC XX.
    05   WS-T01R-MISC-FORM-HDR-NAME         PIC X(20).
    05   FILLER                             PIC XX.
    05   WS-T01R-MISC-FORM-HDR-DATE.
         10   WS-T01R-MISC-FORM-HDR-CC      PIC XX.
         10   WS-T01R-MISC-FORM-HDR-YY      PIC XX.
         10   WS-T01R-MISC-FORM-HDR-MM      PIC XX.
    05   FILLER                             PIC X(280).

01  WS-T01R-MISC-FORM-TRL REDEFINES WS-T01R-MISC-FORM-RCD.
    05   WS-T01R-MISC-FORM-TRL-VALUE        PIC X(10).
    05   FILLER                             PIC XX.
    05   WS-T01R-MISC-FORM-TRL-COUNT        PIC 9(8).
    05   FILLER                             PIC XX.
    05   WS-T01R-MISC-FORM-TRL-AMOUNT       PIC S9(10)V99.
    05   FILLER                             PIC X(286).
EJECT
040100***************************************************************** 03500001
040200*        B&CCW ISSUES FILE                                      * 03510001
040300*                                                               * 03520001
040400* THIS FILE LAYOUT SHOULD MATCH COPYCODE CLCWW013               * 03530001
040500***************************************************************** 03540001
01  WS-T03R-BCCW-RCD.
    05   WS-T03R-BCCW-BUS-CODE           PIC X(4).
    05   WS-T03R-BCCW-LABEL-CODE         PIC 9(4).
    05   WS-T03R-BCCW-BRANCH-CODE        PIC X(3).
         88 WS-T03R-BCCW-CLOC-BR-CODE            VALUE "048".
    05   FILLER                          PIC X   VALUE SPACES.
    05   WS-T03R-BCCW-CHECK-NUM          PIC X(8).
    05   WS-T03R-BCCW-NAME               PIC X(40).
    05   WS-T03R-BCCW-ADDRESS-1          PIC X(40).
    05   WS-T03R-BCCW-ADDRESS-2          PIC X(40).
    05   WS-T03R-BCCW-CITY               PIC X(28).
    05   WS-T03R-BCCW-STATE              PIC X(5).
    05   WS-T03R-BCCW-ZIPCODE            PIC X(11).
    05   WS-T03R-BCCW-COMPASS-CODE       PIC X(3).
    05   WS-T03R-BCCW-DESC               PIC X(60).
    05   WS-T03R-BCCW-DISB-AMT           PIC S9(10)V99.
    05   WS-T03R-BCCW-DISB-SEQ           PIC 9(9).
    05   WS-T03R-BCCW-SSN                PIC X(16).
    05   WS-T03R-BCCW-BUS-UNIT           PIC X(5).
    05   WS-T03R-BCCW-OP-LOC             PIC X(4).
    05   FILLER                          PIC X(24) VALUE SPACES.
    05   WS-T03R-BCCW-TAX-TYPE           PIC X(01).
         88 WS-T03R-VALID-TAX-TYPE                 VALUE "3" "7".
    05   WS-T03R-BCCW-TIN-IND            PIC X(01).
    05   WS-T03R-BCCW-A-CONSTANT         PIC X      VALUE "A".

01  WS-T03R-BCCW-HDR REDEFINES WS-T03R-BCCW-RCD.
    05   WS-T03R-BCCW-HDR-VALUE          PIC X(10).
    05   FILLER                          PIC X(2).
    05   WS-T03R-BCCW-HDR-ID             PIC X(17).
    05   FILLER                          PIC X(10).
    05   WS-T03R-BCCW-HDR-DATE.
         10   WS-T03R-BCCW-HDR-CC        PIC XX.
         10   WS-T03R-BCCW-HDR-YY        PIC XX.
         10   WS-T03R-BCCW-HDR-MM        PIC XX.
         10   WS-T03R-BCCW-HDR-DD        PIC XX.
    05   FILLER                          PIC X(273).

01  WS-T03R-BCCW-TRL REDEFINES WS-T03R-BCCW-RCD.
    05   WS-T03R-BCCW-TRL-VALUE          PIC X(10).
    05   FILLER                          PIC X(2).
    05   WS-T03R-BCCW-TRL-CNT            PIC 9(8).
    05   FILLER                          PIC X(10).
    05   WS-T03R-BCCW-TRL-AMT            PIC S9(13)V99.
    05   FILLER                          PIC X(275).
EJECT
045200***************************************************************** 03970001
045300*        DEFT  ISSUES FILE                                      * 03980001
045400*                                                               * 03990001
045500***************************************************************** 04000001
01  WS-T04R-DEFT-RCD.
    05   WS-T04R-DEFT-BUS-CODE           PIC X(04).
    05   WS-T04R-DEFT-LABEL-CODE         PIC 9(04).
    05   WS-T04R-DEFT-BRANCH-CODE        PIC X(03).
    05   WS-T04R-DEFT-FILLER1            PIC X(01).
    05   WS-T04R-DEFT-BATCH-NUM          PIC X(08).
    05   WS-T04R-DEFT-NAME               PIC X(40).
    05   WS-T04R-DEFT-ADDRESS-1          PIC X(40).
    05   WS-T04R-DEFT-ADDRESS-2          PIC X(40).
    05   WS-T04R-DEFT-CITY               PIC X(28).
    05   WS-T04R-DEFT-STATE              PIC X(05).
    05   WS-T04R-DEFT-ZIPCODE            PIC X(11).
    05   WS-T04R-DEFT-COMPASS-CODE       PIC X(03).
    05   WS-T04R-DEFT-DESC               PIC X(60).
    05   WS-T04R-DEFT-DISB-AMT           PIC S9(10)V99.
    05   WS-T04R-DEFT-DISB-SEQ           PIC 9(09).
    05   WS-T04R-DEFT-SSN                PIC X(16).
    05   WS-T04R-DEFT-PROD-TYPE          PIC X(02).
    05   WS-T04R-DEFT-BUS-UNIT           PIC X(05).
    05   WS-T04R-DEFT-OP-LOC             PIC X(04).
    05   WS-T04R-DEFT-LINE-NBR           PIC X(07).
    05   WS-T04R-DEFT-BNK-STLMT-DT.
         10 WS-T04R-DEFT-BNK-STLMT-CC    PIC X(02).
         10 WS-T04R-DEFT-BNK-STLMT-YY    PIC X(02).
         10 FILLER                       PIC X(01).
         10 WS-T04R-DEFT-BNK-STLMT-MM    PIC X(02).
         10 FILLER                       PIC X(01).
         10 WS-T04R-DEFT-BNK-STLMT-DD    PIC X(02).
    05   WS-T04R-DEFT-FILLER2            PIC X(05).
    05   WS-T04R-DEFT-TAX-TYPE           PIC X(01).
         88 WS-T04R-DEFT-VALID-TAX-TYPE  VALUE "3" "7".
    05   WS-T04R-DEFT-TIN-IND            PIC X(01).
    05   WS-T04R-DEFT-A-CONSTANT         PIC X(01)    VALUE "A".

01  WS-T04R-DEFT-HDR REDEFINES WS-T04R-DEFT-RCD.
    05   WS-T04R-DEFT-HDR-VALUE          PIC X(10).
    05   WS-T04R-DEFT-HDR-FILLER1        PIC X(2).
    05   WS-T04R-DEFT-HDR-ID             PIC X(17).
    05   WS-T04R-DEFT-HDR-FILLER2        PIC X(10).
    05   WS-T04R-DEFT-HDR-DATE.
         10   WS-T04R-DEFT-HDR-CC        PIC XX.
         10   WS-T04R-DEFT-HDR-YY        PIC XX.
         10   WS-T04R-DEFT-HDR-MM        PIC XX.
         10   WS-T04R-DEFT-HDR-DD        PIC XX.
    05   WS-T04R-DEFT-HDR-FILLER3        PIC X(273).

01  WS-T04R-DEFT-TRL REDEFINES WS-T04R-DEFT-RCD.
    05   WS-T04R-DEFT-TRL-VALUE          PIC X(10).
    05   WS-T04R-DEFT-TRL-FILLER1        PIC X(2).
    05   WS-T04R-DEFT-TRL-CNT            PIC 9(8).
    05   WS-T04R-DEFT-TRL-FILLER2        PIC X(10).
    05   WS-T04R-DEFT-TRL-AMT            PIC S9(13)V99.
    05   WS-T04R-DEFT-TRL-FILLER3        PIC X(275).
EJECT
051000***************************************************************** 04520001
051100*    REJECT RECYCLING FILE INPUT LAYOUT                         * 04530001
051200***************************************************************** 04540001
01  WS-T05R-REJECT-RECYCLING-RCD.
    05   WS-T05R-REJECT-KEY.
         10   WS-T05R-REJECT-KEY-OP-LOC          PIC X(4).
         10   WS-T05R-REJECT-KEY-BR-DEPT-CD      PIC X(3).
         10   WS-T05R-REJECT-KEY-CHECK-NUM.
051800***************************************************************** 04600001
051900*   THE FOLLOWING (15 LEVEL) APPLY ONLY TO TRANSACTIONS *         04610001
052000*   GENERATED FROM MISC FORM INPUT DATA WHERE A CHECK NUMBER IS * 04620001
052100*   CREATED FOR THE 1099 PROCESS.                               * 04630001
052200***************************************************************** 04640001
              15   WS-T05R-CHECK-PREFIX          PIC X(1).
              15   WS-T05R-CHECK-MONTH           PIC X(2).
              15   WS-T05R-CHECK-SEQ             PIC X(5).
         10   WS-T05R-REJECT-KEY-CHECK-DT        PIC X(8).
         10   WS-T05R-REJECT-KEY-TAX-TYPE        PIC X(1).
         10   WS-T05R-REJECT-KEY-TIN-IND         PIC X(1).
         10   WS-T05R-REJECT-SOURCE-CODE         PIC X(13).
    05   WS-T05R-REJECT-DETAIL                   PIC X(488).

    05   WS-T05R-REJECT-TRANS-DETAIL REDEFINES
              WS-T05R-REJECT-DETAIL.
         10   WS-T05R-OUTPUT-DETAIL.
              15   WS-T05R-BRANCH                PIC X(03).
              15   WS-T05R-NAME                  PIC X(40).
              15   WS-T05R-ADDR-1                PIC X(37).
              15   WS-T05R-ADDR-2                PIC X(43).
              15   WS-T05R-CITY                  PIC X(26).
              15   WS-T05R-STATE                 PIC X(2).
              15   WS-T05R-POSTCODE              PIC X(9).
              15   FILLER                        PIC X(2).
              15   WS-T05R-SSN.
                   20   WS-T05R-SSN-US           PIC X(9).
                   20   WS-T05R-SSN-REMAINDER    PIC X(7).
              15   WS-T05R-OPER-LOC              PIC X(4).
              15   WS-T05R-CHECK-NUM             PIC X(8).
              15   WS-T05R-CHECK-DATE.
                   20   WS-T05R-CHECK-DATE-CC    PIC XX.
                   20   WS-T05R-CHECK-DATE-YY    PIC XX.
                   20   WS-T05R-CHECK-DATE-MM    PIC XX.
                   20   WS-T05R-CHECK-DATE-DD    PIC XX.
              15   WS-T05R-TOTAL-AMT             PIC S9(10)V99.
              15   WS-T05R-1099-AMT              PIC S9(10)V99.
              15   WS-T05R-COMMENT               PIC X(60).
              15   WS-T05R-NBR-DIST-RCD          PIC 9(2).
              15   WS-T05R-DIST-RCD       OCCURS 5 TIMES
                                       INDEXED BY REJECT-INDEX.
                   20   WS-T05R-DIST-COMPASS-CODE PIC X(3).
                   20   WS-T05R-DIST-1099-INDIC   PIC X.
                   20   WS-T05R-DIST-AMT          PIC S9(10)V99.
         10   FILLER                             PIC X(124).
EJECT
    05   WS-T05R-REJECT-MISC-DETAIL REDEFINES
            WS-T05R-REJECT-DETAIL.
         10   WS-T05R-MISC-FORM-OPER-LOC         PIC X(4).
         10   WS-T05R-MISC-FORM-1099-TYPE        PIC X.
         10   WS-T05R-MISC-FORM-SSN              PIC X(9).
         10   WS-T05R-MISC-FORM-REFERENCE        PIC X(11).
         10   WS-T05R-MISC-FORM-AMT              PIC 9(8)V99.
         10   WS-T05R-MISC-FORM-PAY-YY           PIC XX.
         10   WS-T05R-MISC-FORM-NAME.
              15   WS-T05R-MISC-FORM-NAME-LAST   PIC X(38).
              15   WS-T05R-MISC-FORM-NAME-FI     PIC X.
              15   WS-T05R-MISC-FORM-NAME-MI     PIC X.
         10   FILLER                             PIC XXX.
         10   WS-T05R-MISC-FORM-ADDR-1           PIC X(37).
         10   WS-T05R-MISC-FORM-ADDR-2           PIC X(43).
         10   WS-T05R-MISC-FORM-CITY             PIC X(27).
         10   WS-T05R-MISC-FORM-STATE            PIC XX.
         10   WS-T05R-MISC-FORM-POSTCODE         PIC X(9).
         10   WS-T05R-MISC-FORM-BRANCH           PIC X(3).
         10   WS-T05R-MISC-FORM-DESCRIPTION      PIC X(40).
         10   WS-T05R-MISC-FORM-AMT-IND          PIC X.
         10   WS-T05R-MISC-FORM-SSN-IND          PIC X.
         10   FILLER                             PIC X(9).
         10   WS-T05R-MISC-FORM-TRANS-CODE       PIC X.
         10   FILLER                             PIC X(235).
EJECT
EJECT
01  WS-T05R-REJECT-RECYCLING-HDR REDEFINES
       WS-T05R-REJECT-RECYCLING-RCD.
    05   WS-T05R-REJ-CYCLE-HDR-VALUE              PIC X(10).
    05   FILLER                                   PIC XX.
    05   WS-T05R-REJ-CYCLE-HDR-ID                 PIC X(20).
    05   FILLER                                   PIC XX.
    05   WS-T05R-REJ-CYCLE-HDR-DATE.
         10  WS-T05R-REJ-CYCLE-HDR-CC             PIC XX.
         10  WS-T05R-REJ-CYCLE-HDR-YY             PIC XX.
         10  WS-T05R-REJ-CYCLE-HDR-MM             PIC XX.
    05   FILLER                                   PIC X(486).

01  WS-T05R-REJECT-RECYCLING-TRL REDEFINES
       WS-T05R-REJECT-RECYCLING-RCD.
    05   WS-T05R-REJ-CYCLE-TRL-VALUE              PIC X(10).
    05   FILLER                                   PIC XX.
    05   WS-T05R-REJ-CYCLE-TRL-COUNT              PIC 9(8).
    05   FILLER                                   PIC XX.
    05   WS-T05R-REJ-CYCLE-TRL-AMT                PIC S9(10)V99.
    05   FILLER                                   PIC X(492).
EJECT
061200***************************************************************** 05520001
061300*    1099 REPORTABLE ENTRY CODE TABLE                           * 05530001
061400***************************************************************** 05540001
01  WS-T07R-1099ENTRY-CODE-TBL.
    05  WS-T07R-1099ENTRY-CODES      OCCURS  150   TIMES
                                      INDEXED BY CODE-INDEX.
        10  WS-T07R-1099ENTRY-CODE               PIC X(3).
        10  FILLER                               PIC X(2).
        10  WS-T07R-1099ENTRY-TAX-TYPE           PIC X(1).
        10  FILLER                               PIC X(3).
        10  WS-T07R-1099ENTRY-DESC               PIC X(63).
        10  WS-T07R-1099ENTRY-EFF-DT             PIC X(8).
EJECT
062500***************************************************************** 05620001
062600*      CONTROL CARD DEFINITION                                  * 05630001
062700***************************************************************** 05640001
01  CONTROL-CARD-IN1.
    05  CC-TAX-YEAR-DATE1.
        10  CC-TAX-CC1                           PIC XX.
        10  CC-TAX-YY1                           PIC XX.
        10  CC-TAX-MM1                           PIC XX.
        10  CC-TAX-DD1                           PIC XX.
    05  FILLER                                   PIC X(72).
EJECT
063600***************************************************************** 05730001
063700*      OUTPUT AREA                                              * 05740001
063800***************************************************************** 05750001
063900*      OUTPUT RECORD FOR TRANSACTIONS PASSING EDITS             * 05760001
064000***************************************************************** 05770001
01  WS-T01W-OUTPUT-TRANS-RCD.
    05   WS-T01W-REC-KEY.
         10   WS-T01W-CHECK-NUM-KEY.
064400***************************************************************** 05800001
064500*   THE FOLLOWING (15 LEVEL) DETAIL APPLY ONLY TO TRANSACTIONS  * 05810001
064600*   GENERATED FROM MISC FORM INPUT DATA WHERE A CHECK NUMBER IS * 05820001
064700*   CREATED FOR THE 1099 PROCESS.                               * 05830001
064800***************************************************************** 05840001
           15   WS-T01W-CHECK-PREFIX             PIC X(1).
           15   WS-T01W-CHECK-MONTH              PIC X(2).
           15   WS-T01W-CHECK-SEQ                PIC X(5).
         10   WS-T01W-TAX-TYPE                   PIC X(1).
         10   WS-T01W-TIN-IND                    PIC X(1).
    05   WS-T01W-SOURCE-CODE                     PIC X(13).
    05   WS-T01W-TRANSACTION-INDICATOR    PIC X    VALUE SPACES.
         88   WS-T01W-TRANS-INDIC-ADD              VALUE "A".
         88   WS-T01W-TRANS-INDIC-DEL              VALUE "D".
         88   WS-T01W-TRANS-INDIC-CHG              VALUE "C".
    05   WS-T01W-OUTPUT-DETAIL.
         10   WS-T01W-BRANCH.
              15   WS-T01W-BRANCH-CODE.
                   20   WS-T01W-BRANCH-POS1    PIC X.
                   20   WS-T01W-BRANCH-POS2    PIC X.
              15   WS-T01W-BRANCH-POS3    PIC X.
         10   WS-T01W-NAME                PIC X(40).
         10   WS-T01W-ADDR-1              PIC X(37).
         10   WS-T01W-ADDR-2              PIC X(43).
         10   WS-T01W-CITY                PIC X(26).
         10   WS-T01W-STATE               PIC X(2).
         10   WS-T01W-POSTCODE            PIC X(9).
         10   FILLER                      PIC X(2).
         10   WS-T01W-SSN.
              15   WS-T01W-SSN-US         PIC X(9).
                   88  ALL-ONES           VALUE ALL "1".
                   88  ALL-TWOS           VALUE ALL "2".
                   88  ALL-THREES         VALUE ALL "3".
                   88  ALL-FOURS          VALUE ALL "4".
                   88  ALL-FIVES          VALUE ALL "5".
                   88  ALL-SIXES          VALUE ALL "6".
                   88  ALL-SEVENS         VALUE ALL "7".
                   88  ALL-EIGHTS         VALUE ALL "8".
                   88  ALL-NINES          VALUE ALL "9".
              15   WS-T01W-SSN-REMAINDER  PIC X(7).
         10   WS-T01W-OPER-LOC            PIC X(4).
              88 CANADIAN-OP-LOC  VALUE "6572" "3798".
         10   WS-T01W-CHECK-NUM           PIC X(8).
         10   WS-T01W-CHECK-DATE.
              15   WS-T01W-CHECK-DATE-CC  PIC XX.
              15   WS-T01W-CHECK-DATE-YY  PIC XX.
              15   WS-T01W-CHECK-DATE-MM  PIC XX.
              15   WS-T01W-CHECK-DATE-DD  PIC XX.
         10   WS-T01W-TOTAL-AMT           PIC S9(10)V99.
         10   WS-T01W-1099-AMT            PIC S9(10)V99.
         10   WS-T01W-COMMENT             PIC X(60).
         10   WS-T01W-NBR-DIST-RCD        PIC 9(2).
         10   WS-T01W-DIST-RCD            OCCURS 5 TIMES
                                       INDEXED BY DISB-INDEX.
              15   WS-T01W-DIST-COMPASS-CODE     PIC X(3).
              15   WS-T01W-DIST-1099-INDIC       PIC X.
              15   WS-T01W-DIST-AMT              PIC S9(10)V99.
         10   WS-T01W-LINE-NBR            PIC X(07).
    05   FILLER                           PIC X(55).
EJECT
01  WS-T01W-OUTPUT-TRANS-HDR REDEFINES WS-T01W-OUTPUT-TRANS-RCD.
    05   WS-T01W-OUTPUT-HDR-VALUE         PIC X(10).
    05   FILLER                           PIC XX.
    05   WS-T01W-OUTPUT-HDR-ID            PIC X(20).
    05   FILLER                           PIC XX.
    05   WS-T01W-OUTPUT-HDR-DATE.
         10  WS-T01W-OUTPUT-HDR-CC        PIC XX.
         10  WS-T01W-OUTPUT-HDR-YY        PIC XX.
         10  WS-T01W-OUTPUT-HDR-MM        PIC XX.
    05   FILLER                           PIC X(410).

01  WS-T01W-OUTPUT-TRANS-TRL REDEFINES WS-T01W-OUTPUT-TRANS-RCD.
    05   WS-T01W-OUTPUT-TRL-VALUE         PIC X(10).
    05   FILLER                           PIC XX.
    05   WS-T01W-OUTPUT-TRL-CNT           PIC 9(8).
    05   FILLER                           PIC XX.
    05   WS-T01W-OUTPUT-TRL-AMT           PIC S9(10)V99.
    05   FILLER                           PIC X(416).
EJECT
072300***************************************************************** 06570001
072400*      REJECT RECORD FOR TRANSACTIONS NOT PASSING EDITS         * 06580001
072500***************************************************************** 06590001
01  WS-T02W-REJECT-RECYCLING-RCD.
    05   WS-T02W-REJECT-KEY.
         10   WS-T02W-REJECT-KEY-OP-LOC      PIC X(4).
         10   WS-T02W-REJECT-KEY-BR-DEPT-CD  PIC X(3).
         10   WS-T02W-REJECT-KEY-CHECK-NUM   PIC X(8).
         10   WS-T02W-REJECT-KEY-CHECK-DT    PIC X(8).
         10   WS-T02W-REJECT-TAX-TYPE        PIC X(1).
         10   WS-T02W-REJECT-TIN-IND         PIC X(1).
         10   WS-T02W-REJECT-SOURCE-CODE     PIC X(13).
    05   WS-T02W-REJECT-DETAIL               PIC X(488).
EJECT
01  WS-T02W-REJECT-RECYCLING-HDR REDEFINES
       WS-T02W-REJECT-RECYCLING-RCD.
    05   WS-T02W-REJECT-HDR-VALUE            PIC X(10).
    05   FILLER                              PIC XX.
    05   WS-T02W-REJECT-HDR-ID               PIC X(20).
    05   FILLER                              PIC XX.
    05   WS-T02W-REJECT-HDR-DATE.
         10  WS-T02W-REJECT-HDR-CC           PIC XX.
         10  WS-T02W-REJECT-HDR-YY           PIC XX.
         10  WS-T02W-REJECT-HDR-MM           PIC XX.
    05   FILLER                              PIC X(486).

01  WS-T02W-REJECT-RECYCLING-TRL REDEFINES
       WS-T02W-REJECT-RECYCLING-RCD.
    05   WS-T02W-REJECT-TRL-VALUE            PIC X(10).
    05   FILLER                              PIC XX.
    05   WS-T02W-REJECT-TRL-CNT              PIC 9(8).
    05   FILLER                              PIC XX.
    05   WS-T02W-REJECT-TRL-AMT              PIC S9(10)V99.
    05   FILLER                              PIC X(492).
EJECT
075800***************************************************************** 06900001
075900*      OUTPUT RECORD FOR FOREIGN TRANSACTIONS                   * 06910001
076000***************************************************************** 06920001
01  WS-T03W-FOR-OUTPUT-RCD.
    05   WS-T03W-FOR-SOURCE-CODE             PIC X(15).
    05   WS-T03W-FOREIGN-COUNTRY             PIC X(10).
    05   WS-T03W-FOR-DETAIL                  PIC X(425).

01  WS-T03W-FOR-OUTPUT-HDR REDEFINES WS-T03W-FOR-OUTPUT-RCD.
    05   WS-T03W-FOR-HDR-VALUE               PIC X(10).
    05   FILLER                              PIC XX.
    05   WS-T03W-FOR-HDR-ID                  PIC X(20).
    05   FILLER                              PIC XX.
    05   WS-T03W-FOR-HDR-DATE.
         10  WS-T03W-FOR-HDR-CC              PIC XX.
         10  WS-T03W-FOR-HDR-YY              PIC XX.
         10  WS-T03W-FOR-HDR-MM              PIC XX.
    05   FILLER                              PIC X(410).

01  WS-T03W-FOR-OUTPUT-TRL REDEFINES WS-T03W-FOR-OUTPUT-RCD.
    05   WS-T03W-FOR-TRL-VALUE               PIC X(10).
    05   FILLER                              PIC XX.
    05   WS-T03W-FOR-TRL-CNT                 PIC 9(8).
    05   FILLER                              PIC XX.
    05   WS-T03W-FOR-TRL-AMT                 PIC S9(10)V99.
    05   FILLER                              PIC X(416).
EJECT
078500***************************************************************** 07170001
078600*      OUTPUT RECORD FOR EXCLUDED TRANSACTIONS                  * 07180001
078700*        (TRANSACTIONS W/O SSN OR $0 REPORTABLE VALUE)          * 07190001
078800***************************************************************** 07200001
01  WS-T04W-EXCLUDES-OUTPUT-RCD             PIC X(450).

01  WS-T04W-EXCLUDES-HDR REDEFINES
       WS-T04W-EXCLUDES-OUTPUT-RCD.
    05   WS-T04W-EXCLUDES-HDR-VALUE         PIC X(10).
    05   FILLER                             PIC XX.
    05   WS-T04W-EXCLUDES-HDR-ID            PIC X(20).
    05   FILLER                             PIC XX.
    05   WS-T04W-EXCLUDES-HDR-DATE.
         10  WS-T04W-EXCLUDES-CC            PIC XX.
         10  WS-T04W-EXCLUDES-YY            PIC XX.
         10  WS-T04W-EXCLUDES-MM            PIC XX.
    05   FILLER                             PIC X(410).

01  WS-T04W-EXCLUDES-TRL REDEFINES
       WS-T04W-EXCLUDES-OUTPUT-RCD.
    05   WS-T04W-EXCLUDES-VALUE             PIC X(10).
    05   FILLER                             PIC XX.
    05   WS-T04W-EXCLUDES-CNT               PIC 9(8).
    05   FILLER                             PIC XX.
    05   WS-T04W-EXCLUDES-AMT               PIC S9(10)V99.
    05   FILLER                             PIC X(416).
EJECT
081200***************************************************************** 07440001
081300*      OUTPUT RECORD FOR THE REJECT REPORT FILE                 * 07450001
081400***************************************************************** 07460001
01  WS-C01W-REJ-RPT-OUTPUT-RCD.
    05   WS-C01W-REJECT-KEY.
         10   WS-C01W-REJ-RPT-KEY-OP-LOC          PIC X(4).
         10   WS-C01W-REJ-RPT-KEY-BR-DEPT-CD      PIC X(3).
         10   WS-C01W-REJ-RPT-KEY-CHECK-NUM       PIC X(8).
         10   WS-C01W-REJ-RPT-KEY-CHECK-DT        PIC X(8).
         10   WS-C01W-REJ-RPT-TAX-TYPE            PIC X(1).
         10   WS-C01W-REJ-RPT-TIN-IND             PIC X(1).
         10   WS-C01W-REJ-RPT-SOURCE-CODE         PIC X(13).
    05   WS-C01W-REJ-RPT-REJECT-CODES             PIC X(10).
    05   WS-C01W-REJ-RPT-DETAIL                   PIC X(371).
    05   FILLER                                   PIC X(06).

01  WS-C01W-REJ-RPT-OUTPUT-HDR REDEFINES
       WS-C01W-REJ-RPT-OUTPUT-RCD.
    05   WS-C01W-REJ-RPT-HDR-VALUE                PIC X(10).
    05   FILLER                                   PIC XX.
    05   WS-C01W-REJ-RPT-HDR-ID                   PIC X(20).
    05   FILLER                                   PIC XX.
    05   WS-C01W-REJ-RPT-HDR-DATE.
         10  WS-C01W-REJ-RPT-HDR-CC               PIC XX.
         10  WS-C01W-REJ-RPT-HDR-YY               PIC XX.
         10  WS-C01W-REJ-RPT-HDR-MM               PIC XX.
    05   FILLER                                   PIC X(385).

01  WS-C01W-REJ-RPT-OUTPUT-TRL REDEFINES
       WS-C01W-REJ-RPT-OUTPUT-RCD.
    05   WS-C01W-REJ-RPT-TRL-VALUE                PIC X(10).
    05   FILLER                                   PIC XX.
    05   WS-C01W-REJ-RPT-TRL-CNT                  PIC 9(8).
    05   FILLER                                   PIC XX.
    05   WS-C01W-REJ-RPT-TRL-AMT                  PIC S9(10)V99.
    05   FILLER                                   PIC X(391).
EJECT
084900***************************************************************** 07790001
085000*      COUNTERS                                                 * 07800001
085100***************************************************************** 07810001
01  CNT-COUNTERS.
    05  WS-MISC-FORM-TRANS-COUNTER      PIC 9(6)    VALUE  0.
    05  WS-MISC-FORM-SEQ-CNT            PIC 9(5)    VALUE  0.
    05  WS-BCCW-TRANS-COUNTER           PIC 9(6)    VALUE  0.
    05  WS-BCCW-DIST-COUNTER            PIC 9(6)    VALUE  0.
    05  WS-BCCW-TRL-COUNTER             PIC 9(6)    VALUE  0.
    05  WS-DEFT-TRANS-COUNTER           PIC 9(6)    VALUE  0.
    05  WS-DEFT-DIST-COUNTER            PIC 9(6)    VALUE  0.
    05  WS-DEFT-TRL-COUNTER             PIC 9(6)    VALUE  0.
    05  WS-REJ-CYCLE-TRANS-COUNTER      PIC 9(6)    VALUE  0.
    05  WS-OUTPUT-TRANS-CNT             PIC 9(6)    VALUE  0.
    05  WS-FOR-TRANS-CNT                PIC 9(6)    VALUE  0.
    05  WS-REJ-TRANS-CNT                PIC 9(6)    VALUE  0.
    05  WS-EXCLUDES-TRANS-CNT           PIC 9(6)    VALUE  0.
    05  WS-TOTAL-OUTPUT-TRANS-CNT       PIC 9(6)    VALUE  0.
    05  WS-TOTAL-FOR-TRANS-CNT          PIC 9(6)    VALUE  0.
    05  WS-TOTAL-REJ-TRANS-CNT          PIC 9(6)    VALUE  0.
    05  WS-TOTAL-REJ-RPT-TRANS-CNT      PIC 9(6)    VALUE  0.
    05  WS-TOTAL-EXCLUDES-TRANS-CNT     PIC 9(6)    VALUE  0.

EJECT
087300***************************************************************** 08030001
087400*      SWITCHES                                                 * 08040001
087500***************************************************************** 08050001
01  SW-SWITCHES.
    05  SW-BCCW-BUILD-COMPLETE          PIC X       VALUE "N".
        88   SW-BCCW-BUILD-COMPLETE-YES             VALUE "Y".
    05  SW-DEFT-BUILD-COMPLETE          PIC X       VALUE "N".
        88   SW-DEFT-BUILD-COMPLETE-YES             VALUE "Y".

EJECT
088300***************************************************************** 08130001
088400*      INDICATORS                                               * 08140001
088500***************************************************************** 08150001
01  WS-INDICATORS.
    05  REJECT-INDICATORS.
        10   REJECT-FLAG                PIC X      VALUE SPACE.
        10   REJECT-NAME                PIC X      VALUE SPACE.
             88  REJECT-NAME-ERR                   VALUE "Y".
        10   REJECT-ADDRESS             PIC X      VALUE SPACE.
             88  REJECT-ADDRESS-ERR                VALUE "Y".
        10   REJECT-CITY                PIC X      VALUE SPACE.
             88  REJECT-CITY-ERR                   VALUE "Y".
        10   REJECT-STATE               PIC X      VALUE SPACE.
             88  REJECT-STATE-ERR                  VALUE "Y".
        10   REJECT-POSTCODE            PIC X      VALUE SPACE.
             88  REJECT-POSTCODE-ERR               VALUE "Y".
        10   REJECT-SSN                 PIC X      VALUE SPACE.
             88  REJECT-SSN-ERR                    VALUE "Y".
        10   REJECT-AMOUNT              PIC X      VALUE SPACE.
        10   FILLER                     PIC X(2)   VALUE SPACE.
    05  FOREIGN-INDICATOR               PIC X.
        88 FOREIGN-INDICATOR-NO                    VALUE "N".
        88 FOREIGN-INDICATOR-CDN                   VALUE "C".
        88 FOREIGN-INDICATOR-YES                   VALUE "Y".
        88 FOREIGN-INDICATOR-PR                    VALUE "P".
    05  WS-US-IND                       PIC X      VALUE "N".
        88 WS-US-IND-YES                           VALUE "Y".
    05  WS-CDN-IND                      PIC X      VALUE "N".
        88 WS-CDN-IND-YES                          VALUE "Y".
    05  TEN99-T01R-MISC-FORM-EOF        PIC X      VALUE "N".
        88   TEN99-T01R-MISC-FORM-EOF-YES          VALUE "Y".
    05  TEN99-T03R-BCCW-EOF             PIC X      VALUE "N".
        88   TEN99-T03R-BCCW-EOF-YES               VALUE "Y".
    05  TEN99-T04R-DEFT-EOF             PIC X      VALUE "N".
        88   TEN99-T04R-DEFT-EOF-YES               VALUE "Y".
    05  TEN99-T05R-REJ-CYCLE-EOF        PIC X      VALUE "N".
        88   TEN99-T05R-REJ-CYCLE-EOF-YES          VALUE "Y".
    05  END-OF-BCCW-DETAIL              PIC X      VALUE "N".
        88   END-OF-BCCW-DETAIL-YES                VALUE "Y".
    05  END-OF-BCCW-HEADERS             PIC X      VALUE "N".
        88   END-OF-BCCW-HEADERS-YES               VALUE "Y".
    05  END-OF-DEFT-DETAIL              PIC X      VALUE "N".
        88   END-OF-DEFT-DETAIL-YES                VALUE "Y".
    05  END-OF-DEFT-HEADERS             PIC X      VALUE "N".
        88   END-OF-DEFT-HEADERS-YES               VALUE "Y".
    05  EOF-CONTROL-CARD                PIC X      VALUE "N".
        88   EOF-CONTROL-CARD-YES                  VALUE "Y".
    05  EOF-1099ENTRY-TABLE             PIC X      VALUE "N".
        88   EOF-1099ENTRY-TABLE-YES               VALUE "Y".
    05  ERROR-FLAG                      PIC X      VALUE "N".
EJECT
093400***************************************************************** 08660001
093500*      LITERALS                                                 * 08670001
093600***************************************************************** 08680001
01  LIT-LITERALS.
    05  LIT-GENERAL.
        10  LIT-NO-CONTROL-CARD         PIC X(132)
                     VALUE "NO CONTROL CARD--JOB TERMINATED".
        10  LIT-TRANS-TLS-DO-NOT-AGREE  PIC X(132)
               VALUE "TRANSACTION TOTALS DO NOT AGREE".
        10  LIT-CDN                     PIC X       VALUE "C".
        10  LIT-PR                      PIC X       VALUE "P".
        10  LIT-CANADA                  PIC X(10)
               VALUE "CANADA".
        10  LIT-PUERTO-RICO             PIC X(10)
               VALUE "PTO RICO ".
        10  LIT-GEN-DEL                 PIC X(16)
               VALUE "GENERAL DELIVERY".
        10  LIT-ERROR-FLAG-EQUALS-YES   PIC X(132)
               VALUE "ERROR FLAG EQUALS YES IN 0000-MAINLINE".
        10  LIT-1                       PIC 9       VALUE 1.
        10  LIT-5                       PIC 9       VALUE 5.
        10  LIT-NUM-OF-1099-CODES       PIC 999     VALUE 150.
        10  LIT-TW                      PIC X(2)    VALUE "TW".
        10  LIT-PR-STATE-CODE           PIC X(2)    VALUE "PR".
        10  LIT-ZERO                    PIC 9       VALUE 0.
        10  LIT-ZERO-SSN                PIC X(9)
               VALUE "000000000".
        10  LIT-A                       PIC X       VALUE "A".
        10  LIT-TAX-MONTH-JAN           PIC 99   VALUE  1.
        10  LIT-TAX-MONTH-DEC           PIC 99   VALUE 12.
        10  LIT-TAX-MONTH-YEAR-END      PIC 99   VALUE 13.
        10  LIT-GRAND-TOTAL             PIC X(132)
               VALUE "GRAND TOTAL FOR ALL RECORDS PROCESSED".


    EJECT
    05  LIT-MISC-FORM-LITERALS.
        10  LIT-MISC-FORM                PIC X(13)
               VALUE "MISC FORM   ".
        10  LIT-MISC-FORM-HDR            PIC X(20)
               VALUE "1099 VENDOR CYCLE TR".
        10  LIT-MISC-INPUT-SUCCESS       PIC X(132)
     VALUE "MISCELLANEOUS INPUT (T01R) SUCCESSFULLY PROCESSED".
        10  LIT-FOR-MISCELLANEOUS-INPUT  PIC X(132)
               VALUE "FOR MISCELLANEOUS INPUT FILE".
        10  LIT-MISC-FORM-CONTROL-TOTALS PIC X(30)
               VALUE "MISC FORM RECORDS WRITTEN ".
        10  LIT-M                        PIC X      VALUE "M".
098200***************************************************************** 09140001
098300*   LIT-M IDENTIFIES THE SEQUENCE FOR MISC FORM INPUT BECAUSE   * 09150001
098400*   THERE IS NO "CHECK NUMBER" PRESENT IN THIS DATA.  THE CHECK * 09160001
098500*   NUMBER IS NEEDED FOR THE MASTER UPDATE PROGRAM.             * 09170001
098600***************************************************************** 09180001
    05  LIT-REJECT-RECYCLE-LITERALS.
        10  LIT-REJ-CYCLE-SUCCESS        PIC X(132)
     VALUE "REJECT CYCLE FILE (T05R) SUCCESSFULLY PROCESSED".
        10  LIT-FOR-REJECT-CYCLE-INPUT   PIC X(132)
               VALUE "FOR REJECT RECYCLE INPUT FILE".
        10  LIT-REJ-CYCLE-CONTROL-TOTALS PIC X(30)
               VALUE "REJ RECYCLED RECORDS WRITTEN".
        10  LIT-UNKWN-SOURCE-CODE-TYPE   PIC X(30)
               VALUE "UNKNOWN REJECT SOURCE CODE  ".
EJECT
    05  LIT-BCCW-LITERALS.
        10  LIT-BCCW                     PIC X(22)
               VALUE "B&CCW           ".
        10  LIT-BCCW-SUCCESS             PIC X(132)
     VALUE "B&CCW ISSUES (T03R) SUCCESSFULLY PROCESSED    ".
        10  LIT-FOR-BCCW-INPUT           PIC X(132)
               VALUE "FOR B&CCW ISSUES FILE (T03R)    ".
        10  LIT-BCCW-CONTROL-TOTALS      PIC X(30)
               VALUE "BCCW RECORDS WRITTEN     ".
        10  LIT-BCCW-FILE                PIC X(22)
               VALUE "B&CCW 1099 FILE".
EJECT
    05  LIT-DEFT-LITERALS.
        10  LIT-DEFT                     PIC X(22)
               VALUE "DEFT            ".
        10  LIT-DEFT-SUCCESS             PIC X(132)
     VALUE "DEFT ISSUES (T04R) SUCCESSFULLY PROCESSED     ".
        10  LIT-FOR-DEFT-INPUT           PIC X(132)
               VALUE "FOR DEFT ISSUES FILE (T04R)     ".
        10  LIT-DEFT-CONTROL-TOTALS      PIC X(30)
               VALUE "DEFT RECORDS WRITTEN     ".
        10  LIT-DEFT-FILE                PIC X(22)
               VALUE "DEFT 1099 FILE        ".
EJECT
    05  LIT-1099ENTRY-LITERALS.
        10  LIT-ISS                      PIC X(22)
               VALUE "CCW ISSUES       ".
        10  LIT-INCORRECT-1099ENT-RCD-TYPE PIC X(132)
               VALUE "INCORRECT 1099 ENTRY CODE TYPE".
        10  LIT-NO-1099ENTRY-TABLE       PIC X(22)
               VALUE "NO 1099 ENTRY CODE TBL".
        10  LIT-DIST-AMOUNT-ERR-2        PIC X(132)
               VALUE "FOR THE FOLLOWING 1099 ENTRY".
EJECT
    05  LIT-OUTPUT-FILE-LITERALS.
        10  LIT-TRANS-FILE               PIC X(15)
               VALUE "TRANS FILE     ".
        10  LIT-FOREIGN-FILE             PIC X(15)
               VALUE "FOREIGN FILE   ".
        10  LIT-REJECT-FILE              PIC X(15)
               VALUE "REJECT FILE    ".
        10  LIT-EXCLUDES-FILE            PIC X(15)
               VALUE "EXCLUDES FILE  ".
        10  LIT-TEN99-OUTPUT-TRANS       PIC X(20)
               VALUE "1099 TRANS          ".
        10  LIT-TEN99-REJECT-TRANS       PIC X(20)
               VALUE "1099 REJECT CYCLE TR".
        10  LIT-TEN99-FOREIGN-TRANS      PIC X(20)
               VALUE "1099 FOREIGN TRANS  ".
        10  LIT-TEN99-EXCLUDES-TRANS     PIC X(20)
               VALUE "1099 EXCLUDED TRANS ".
        10  LIT-TEN99-REJ-REPORT-TRANS   PIC X(20)
               VALUE "1099 REJ REPORT TRAN".
EJECT
105100***************************************************************** 09830001
105200*      MESSAGE AREA                                             * 09840001
105300***************************************************************** 09850001
01  MSG-NO-DATA.
    05  MSG-LITERAL                      PIC X(11)
           VALUE "NO DATA ON ".
    05  MSG-NO-DATA-FILE-NAME            PIC X(22).

01  MSG-INCORRECT-DATE.
    05  MSG-LITERAL                      PIC X(19)
           VALUE "INCORRECT DATE FOR ".
    05  MSG-FILE-NAME                    PIC X(22).

01  MSG-TRAILER-COUNT-DISPLAY.
    05  MSG-LIT-FILE-COUNT               PIC X(18)
           VALUE "FILE COUNT TOTAL".
    05  MSG-FILE-COUNT                   PIC ZZZ,ZZZ,ZZ9.
    05  FILLER                           PIC X(6)   VALUE SPACE.
    05  MSG-LIT-TRAILER-COUNT            PIC X(22)
           VALUE "TRAILER COUNT TOTAL".
    05  MSG-TRAILER-COUNT                PIC ZZZ,ZZZ,ZZ9.

01  MSG-MISC-FORM-SUMMARY.
    05  MSG-LIT-MISC-FILE-COUNT          PIC X(18)
           VALUE "FILE COUNT TOTAL".
    05  MSG-MISC-FILE-COUNT              PIC ZZZ,ZZZ,ZZ9.
    05  FILLER                           PIC X(6)   VALUE SPACE.
    05  MSG-LIT-MISC-FILE-AMT            PIC X(22)
           VALUE "FILE AMOUNT TOTAL".
    05  MSG-MISC-FILE-AMOUNT             PIC $$$,$$$,$$$,$$9.99.

01  MSG-TRAILER-DOLLAR-DISPLAY.
    05  MSG-LIT-FILE-AMOUNT              PIC X(19)
           VALUE "FILE AMOUNT TOTAL".
    05  MSG-FILE-AMOUNT                  PIC $$$,$$$,$$$,$$9.99.
    05  FILLER                           PIC X(6)   VALUE SPACE.
    05  MSG-LIT-TRAILER-AMOUNT           PIC X(23)
           VALUE "TRAILER AMOUNT TOTAL".
    05  MSG-TRAILER-AMOUNT               PIC $$$,$$$,$$$,$$9.99.

01  MSG-CONTROL-TOTALS.
    05  MSG-NUM-RCDS                     PIC ZZZ,ZZ9.
    05  FILLER                           PIC XX     VALUE SPACE.
    05  MSG-LIT-WRITTEN-TO               PIC X(20)
           VALUE "RECORDS WRITTEN TO ".
    05  MSG-OUTPUT-FILE-NAME             PIC X(15)  VALUE SPACE.
    05  FILLER                           PIC XX     VALUE SPACE.
    05  MSG-LIT-AMT-OF-RCD               PIC X(9)
           VALUE "AMOUNT ".
    05  MSG-AMOUNT                       PIC $$$,$$$,$$$,$$9.99.

01  MSG-BAD-FILE.
    05  MSG-BAD-FILE-MSG                 PIC X(20)
           VALUE "INCORRECT FILE FOR  ".
    05  MSG-FILE-ID                      PIC X(22)  VALUE SPACE.

110700***************************************************************** 10390001
110800*      RECORD KEY AREA                                          * 10400001
110900***************************************************************** 10410001
01 WS-REC-KEYS-AREA.
   05 WS-BCCW-KEY.
      10 WS-BCCW-CHECK-NUM          PIC X(8).
      10 WS-BCCW-TAX-TYPE           PIC X(1).
      10 WS-BCCW-TIN-IND            PIC X(1).
   05 WS-DEFT-KEY.
      10 WS-DEFT-BATCH-NUM          PIC X(8).
      10 WS-DEFT-TAX-TYPE           PIC X(1).
      10 WS-DEFT-TIN-IND            PIC X(1).
111900***************************************************************** 10390001
112000*      ACCUMULATORS                                             * 10400001
112100***************************************************************** 10410001
01  ACC-ACCUMULATORS.
    05  WS-MISC-FORM-TRANS-AMT-ACCUM     PIC 9(12)V99 VALUE 0.
    05  WS-BCCW-TRANS-AMT-ACCUM          PIC 9(12)V99 VALUE 0.
    05  WS-BCCW-DIST-AMT-ACCUM           PIC 9(12)V99 VALUE 0.
    05  WS-BCCW-TRL-AMT-ACCUM            PIC 9(12)V99 VALUE 0.
    05  WS-DEFT-TRANS-AMT-ACCUM          PIC 9(12)V99 VALUE 0.
    05  WS-DEFT-DIST-AMT-ACCUM           PIC 9(12)V99 VALUE 0.
    05  WS-DEFT-TRL-AMT-ACCUM            PIC 9(12)V99 VALUE 0.
    05  WS-TRANS-AMT-ACCUM               PIC 9(12)V99 VALUE 0.
113100***************************************************************** 10510001
113200*  ABOVE ACCUMULATOR USED FOR BOTH B&CCW AND ALL REJECTS        * 10520001
113300***************************************************************** 10530001
    05  WS-REJ-CYCLE-TRANS-AMT-ACCUM     PIC 9(12)V99 VALUE 0.
    05  WS-OUTPUT-TRANS-AMT              PIC 9(12)V99 VALUE 0.
    05  WS-FOR-TRANS-AMT                 PIC 9(12)V99 VALUE 0.
    05  WS-REJ-TRANS-AMT                 PIC 9(12)V99 VALUE 0.
    05  WS-EXCLUDES-TRANS-AMT            PIC 9(12)V99 VALUE 0.
    05  WS-TOTAL-OUTPUT-TRANS-AMT        PIC 9(12)V99 VALUE 0.
    05  WS-TOTAL-FOR-TRANS-AMT           PIC 9(12)V99 VALUE 0.
    05  WS-TOTAL-REJ-TRANS-AMT           PIC 9(12)V99 VALUE 0.
    05  WS-TOTAL-REJ-RPT-TRANS-AMT       PIC 9(12)V99 VALUE 0.
    05  WS-TOTAL-EXCLUDES-TRANS-AMT      PIC 9(12)V99 VALUE 0.
EJECT
114500***************************************************************** 10650001
114600*   STATE CONVERSION TABLE                                      * 10660001
114700*     IN NUMERIC SEQUENCE                                       * 10670001
114800***************************************************************** 10680001
01  STBL-STATE-TABLE.
    05  STBL-STATE-CONSTANTS.
        10  FILLER                     PIC X(04)   VALUE "01AL".
        10  FILLER                     PIC X(04)   VALUE "02AZ".
        10  FILLER                     PIC X(04)   VALUE "03AR".
        10  FILLER                     PIC X(04)   VALUE "04CA".
        10  FILLER                     PIC X(04)   VALUE "05CO".
        10  FILLER                     PIC X(04)   VALUE "06CT".
        10  FILLER                     PIC X(04)   VALUE "07DE".
        10  FILLER                     PIC X(04)   VALUE "08DC".
        10  FILLER                     PIC X(04)   VALUE "09FL".
        10  FILLER                     PIC X(04)   VALUE "10GA".
        10  FILLER                     PIC X(04)   VALUE "11ID".
        10  FILLER                     PIC X(04)   VALUE "12IL".
        10  FILLER                     PIC X(04)   VALUE "13IN".
        10  FILLER                     PIC X(04)   VALUE "14IA".
        10  FILLER                     PIC X(04)   VALUE "15KS".
        10  FILLER                     PIC X(04)   VALUE "16KY".
        10  FILLER                     PIC X(04)   VALUE "17LA".
        10  FILLER                     PIC X(04)   VALUE "18ME".
        10  FILLER                     PIC X(04)   VALUE "19MD".
        10  FILLER                     PIC X(04)   VALUE "20MA".
        10  FILLER                     PIC X(04)   VALUE "21MI".
        10  FILLER                     PIC X(04)   VALUE "22MN".
        10  FILLER                     PIC X(04)   VALUE "23MS".
        10  FILLER                     PIC X(04)   VALUE "24MO".
        10  FILLER                     PIC X(04)   VALUE "25MT".
        10  FILLER                     PIC X(04)   VALUE "26NE".
        10  FILLER                     PIC X(04)   VALUE "27NV".
        10  FILLER                     PIC X(04)   VALUE "28NH".
        10  FILLER                     PIC X(04)   VALUE "29NJ".
        10  FILLER                     PIC X(04)   VALUE "30NM".
        10  FILLER                     PIC X(04)   VALUE "31NY".
        10  FILLER                     PIC X(04)   VALUE "32NC".
        10  FILLER                     PIC X(04)   VALUE "33ND".
        10  FILLER                     PIC X(04)   VALUE "34OH".
        10  FILLER                     PIC X(04)   VALUE "35OK".
        10  FILLER                     PIC X(04)   VALUE "36OR".
        10  FILLER                     PIC X(04)   VALUE "37PA".
        10  FILLER                     PIC X(04)   VALUE "38RI".
        10  FILLER                     PIC X(04)   VALUE "39SC".
        10  FILLER                     PIC X(04)   VALUE "40SD".
        10  FILLER                     PIC X(04)   VALUE "41TN".
        10  FILLER                     PIC X(04)   VALUE "42TX".
        10  FILLER                     PIC X(04)   VALUE "43UT".
        10  FILLER                     PIC X(04)   VALUE "44VT".
        10  FILLER                     PIC X(04)   VALUE "45VA".
        10  FILLER                     PIC X(04)   VALUE "46WA".
        10  FILLER                     PIC X(04)   VALUE "47WV".
        10  FILLER                     PIC X(04)   VALUE "48WI".
        10  FILLER                     PIC X(04)   VALUE "49WY".
        10  FILLER                     PIC X(04)   VALUE "50AK".
        10  FILLER                     PIC X(04)   VALUE "51HI".
    05  STBL-STATE-TABLE-R REDEFINES STBL-STATE-CONSTANTS
                                     OCCURS 51 TIMES
                                     ASCENDING KEY IS
                                     STBL-STATE-CODE-N
                                     INDEXED BY STATE-INDX.
        10  STBL-STATE-CODE-N           PIC 9(02).
        10  STBL-STATE-CODE-A           PIC 9(02).

EJECT
121100***************************************************************** 11310001
121200*   STATE CONVERSION TABLE                                      * 11320001
121300*     IN ALPHA SEQUENCE                                         * 11330001
121400***************************************************************** 11340001
01  STBL-STATE-TABLE-X.
    05  STBL-STATE-CONSTANTS-X.
        10  FILLER                     PIC X(04)   VALUE "50AK".
        10  FILLER                     PIC X(04)   VALUE "01AL".
        10  FILLER                     PIC X(04)   VALUE "03AR".
        10  FILLER                     PIC X(04)   VALUE "02AZ".
        10  FILLER                     PIC X(04)   VALUE "04CA".
        10  FILLER                     PIC X(04)   VALUE "05CO".
        10  FILLER                     PIC X(04)   VALUE "06CT".
        10  FILLER                     PIC X(04)   VALUE "08DC".
        10  FILLER                     PIC X(04)   VALUE "07DE".
        10  FILLER                     PIC X(04)   VALUE "09FL".
        10  FILLER                     PIC X(04)   VALUE "10GA".
        10  FILLER                     PIC X(04)   VALUE "51HI".
        10  FILLER                     PIC X(04)   VALUE "14IA".
        10  FILLER                     PIC X(04)   VALUE "11ID".
        10  FILLER                     PIC X(04)   VALUE "12IL".
        10  FILLER                     PIC X(04)   VALUE "13IN".
        10  FILLER                     PIC X(04)   VALUE "15KS".
        10  FILLER                     PIC X(04)   VALUE "16KY".
        10  FILLER                     PIC X(04)   VALUE "17LA".
        10  FILLER                     PIC X(04)   VALUE "20MA".
        10  FILLER                     PIC X(04)   VALUE "19MD".
        10  FILLER                     PIC X(04)   VALUE "18ME".
        10  FILLER                     PIC X(04)   VALUE "21MI".
        10  FILLER                     PIC X(04)   VALUE "22MN".
        10  FILLER                     PIC X(04)   VALUE "24MO".
        10  FILLER                     PIC X(04)   VALUE "23MS".
        10  FILLER                     PIC X(04)   VALUE "25MT".
        10  FILLER                     PIC X(04)   VALUE "32NC".
        10  FILLER                     PIC X(04)   VALUE "33ND".
        10  FILLER                     PIC X(04)   VALUE "26NE".
        10  FILLER                     PIC X(04)   VALUE "28NH".
        10  FILLER                     PIC X(04)   VALUE "29NJ".
        10  FILLER                     PIC X(04)   VALUE "30NM".
        10  FILLER                     PIC X(04)   VALUE "27NV".
        10  FILLER                     PIC X(04)   VALUE "31NY".
        10  FILLER                     PIC X(04)   VALUE "34OH".
        10  FILLER                     PIC X(04)   VALUE "35OK".
        10  FILLER                     PIC X(04)   VALUE "36OR".
        10  FILLER                     PIC X(04)   VALUE "37PA".
        10  FILLER                     PIC X(04)   VALUE "38RI".
        10  FILLER                     PIC X(04)   VALUE "39SC".
        10  FILLER                     PIC X(04)   VALUE "40SD".
        10  FILLER                     PIC X(04)   VALUE "41TN".
        10  FILLER                     PIC X(04)   VALUE "42TX".
        10  FILLER                     PIC X(04)   VALUE "43UT".
        10  FILLER                     PIC X(04)   VALUE "45VA".
        10  FILLER                     PIC X(04)   VALUE "44VT".
        10  FILLER                     PIC X(04)   VALUE "46WA".
        10  FILLER                     PIC X(04)   VALUE "48WI".
        10  FILLER                     PIC X(04)   VALUE "47WV".
        10  FILLER                     PIC X(04)   VALUE "49WY".
    05  STBL-STATE-TABLE-RX REDEFINES STBL-STATE-CONSTANTS-X
                                     OCCURS 51 TIMES
                                     ASCENDING KEY IS
                                     STBL-STATE-CODE-AX
                                     INDEXED BY STATE-INDX-X.
        10  STBL-STATE-CODE-NX          PIC 9(02).
        10  STBL-STATE-CODE-AX          PIC 9(02).

EJECT
127700***************************************************************** 11970001
127800*   CANADIAN PROV CONVERSION TABLE                              * 11980001
127900*     IN NUMERIC SEQUENCE                                       * 11990001
128000***************************************************************** 12000001
01  STBL-PROV-TABLE.
    05  STBL-PROV-CONSTANTS.
        10  FILLER                     PIC X(04)   VALUE "61AB".
        10  FILLER                     PIC X(04)   VALUE "62BC".
        10  FILLER                     PIC X(04)   VALUE "63MB".
        10  FILLER                     PIC X(04)   VALUE "64NB".
        10  FILLER                     PIC X(04)   VALUE "65NL".
        10  FILLER                     PIC X(04)   VALUE "66NT".
        10  FILLER                     PIC X(04)   VALUE "67NS".
        10  FILLER                     PIC X(04)   VALUE "68ON".
        10  FILLER                     PIC X(04)   VALUE "69PE".
        10  FILLER                     PIC X(04)   VALUE "70QU".
        10  FILLER                     PIC X(04)   VALUE "70QC".
        10  FILLER                     PIC X(04)   VALUE "71SK".
        10  FILLER                     PIC X(04)   VALUE "72YT".
    05  STBL-PROV-TABLE-R REDEFINES STBL-PROV-CONSTANTS
                                     OCCURS 13 TIMES
                                     ASCENDING KEY IS
                                     STBL-PROV-CODE-N
                                     INDEXED BY PROV-INDX.
        10  STBL-PROV-CODE-N            PIC 9(02).
        10  STBL-PROV-CODE-A            PIC 9(02).

EJECT
130500***************************************************************** 12250001
130600*   CANADIAN PROV CONVERSION TABLE                              * 12260001
130700*     IN ALPHA SEQUENCE                                         * 12270001
130800***************************************************************** 12280001
01  STBL-PROV-TABLE-X.
    05  STBL-PROV-CONSTANTS-X.
        10  FILLER                     PIC X(04)   VALUE "61AB".
        10  FILLER                     PIC X(04)   VALUE "62BC".
        10  FILLER                     PIC X(04)   VALUE "63MB".
        10  FILLER                     PIC X(04)   VALUE "64NB".
        10  FILLER                     PIC X(04)   VALUE "65NL".
        10  FILLER                     PIC X(04)   VALUE "67NS".
        10  FILLER                     PIC X(04)   VALUE "66NT".
        10  FILLER                     PIC X(04)   VALUE "68ON".
        10  FILLER                     PIC X(04)   VALUE "69PE".
        10  FILLER                     PIC X(04)   VALUE "70QC".
        10  FILLER                     PIC X(04)   VALUE "70QU".
        10  FILLER                     PIC X(04)   VALUE "71SK".
        10  FILLER                     PIC X(04)   VALUE "72YT".
    05  STBL-PROV-TABLE-RX REDEFINES STBL-PROV-CONSTANTS-X
                                     OCCURS 13 TIMES
                                     ASCENDING KEY IS
                                     STBL-PROV-CODE-AX
                                     INDEXED BY PROV-INDX-X.
        10  STBL-PROV-CODE-NX           PIC 9(02).
        10  STBL-PROV-CODE-AX           PIC 9(02).
EJECT
133200***************************************************************** 12520001
133300*    ++INCLUDE C2INX003                                         * 12530001
133400*      COMMON SYSOUT DISPLAY LINES                              * 12540001
133500***************************************************************** 12550001
COPY C2INX003.

EJECT
133900***************************************************************** 12590001
PROCEDURE DIVISION.
134100***************************************************************** 12610001
0000-MAINLINE.
134300***************************************************************** 12630001
    PERFORM 1000-INITIALIZATION
    PERFORM 3000-MAIN-PROCESS
    PERFORM 9000-TERMINATION-ROUTINE
    GOBACK
    .
EJECT
135000***************************************************************** 12700001
1000-INITIALIZATION.
135200***************************************************************** 12720001
    OPEN INPUT
       TEN99-T01R-MISC-TRANS-FILE
       TEN99-T03R-BCCW-FILE
       TEN99-T04R-DEFT-FILE
       TEN99-T05R-REJ-CYCLE-FILE
       WS-T07R-1099ENTRY-CD-FILE
       CC-R01R-CONTROL-CARD
    OUTPUT
       TEN99-T01W-TRANS-OUTPUT-FILE
       TEN99-T02W-REJ-CYCLE-OUT-FILE
       TEN99-C01W-REJ-RPT-OUTPUT-FILE
       TEN99-T03W-FOREIGN-OUTPUT-FILE

136600***************************************************************** 12860001
136700*    THE TEN99-T04W FILE IS EITHER DESIGNED FOR ACCUMULATING    * 12870001
136800*    TRANSACTIONS THAT DO NOT HAVE A SOCIAL SECURITY NUMBER OR  * 12880001
136900*    A 1099 REPORTABLE AMOUNT.  THESE TRANSACTIONS ARE NOT      * 12890001
137000*    TO BE WRITTEN TO THE REJECT FILE.                          * 12900001
137100***************************************************************** 12910001
       TEN99-T04W-EXCLUDES-FILE
       CC-E01W-DISPLAY-FILE

    PERFORM 1130-INCLUDE-SYSOUT-DISPLAY
    PERFORM 7900-READ-CONTROL-CARD-IN

    INITIALIZE             WS-T01W-OUTPUT-TRANS-RCD
                           WS-T02W-REJECT-RECYCLING-RCD
                           WS-T03W-FOR-OUTPUT-RCD
                           WS-T04W-EXCLUDES-OUTPUT-RCD
                           WS-C01W-REJ-RPT-OUTPUT-RCD
    MOVE LOW-VALUES     TO WS-T01W-OUTPUT-HDR-VALUE
                           WS-T02W-REJECT-HDR-VALUE
                           WS-T03W-FOR-HDR-VALUE
                           WS-T04W-EXCLUDES-HDR-VALUE
                           WS-C01W-REJ-RPT-HDR-VALUE
    MOVE CC-TAX-MM1     TO WS-T01W-OUTPUT-HDR-MM
                           WS-T02W-REJECT-HDR-MM
                           WS-T03W-FOR-HDR-MM
                           WS-T04W-EXCLUDES-MM
                           WS-C01W-REJ-RPT-HDR-MM
    MOVE CC-TAX-YY1     TO WS-T01W-OUTPUT-HDR-YY
                           WS-T02W-REJECT-HDR-YY
                           WS-T03W-FOR-HDR-YY
                           WS-T04W-EXCLUDES-YY
                           WS-C01W-REJ-RPT-HDR-YY
    MOVE CC-TAX-CC1     TO WS-T01W-OUTPUT-HDR-CC
                           WS-T02W-REJECT-HDR-CC
                           WS-T03W-FOR-HDR-CC
                           WS-T04W-EXCLUDES-CC
                           WS-C01W-REJ-RPT-HDR-CC
    MOVE LIT-TEN99-OUTPUT-TRANS     TO WS-T01W-OUTPUT-HDR-ID
    MOVE LIT-TEN99-REJECT-TRANS     TO WS-T02W-REJECT-HDR-ID
    MOVE LIT-TEN99-FOREIGN-TRANS    TO WS-T03W-FOR-HDR-ID
    MOVE LIT-TEN99-EXCLUDES-TRANS   TO WS-T04W-EXCLUDES-HDR-ID
    MOVE LIT-TEN99-REJ-REPORT-TRANS TO WS-C01W-REJ-RPT-HDR-ID
    PERFORM 8000-WRITE-HEADERS
    .
EJECT
141100***************************************************************** 13310001
1130-INCLUDE-SYSOUT-DISPLAY.
141300***************************************************************** 13330001
141400*    ++INCLUDE C2INZ001                                         * 13340001
141500*      COMMON INITIAL SYSOUT DISPLAYS                           * 13350001
141600***************************************************************** 13360001

COPY C2INZ001.
EJECT
142000***************************************************************** 13400001
3000-MAIN-PROCESS.
142200***************************************************************** 13420001
142300*      MAIN PROCESSING ROUTINE                                  * 13430001
142400***************************************************************** 13440001
    PERFORM 7910-READ-1099ENTRY-TABLE
       VARYING CODE-INDEX FROM 1 BY 1
       UNTIL CODE-INDEX GREATER THAN LIT-NUM-OF-1099-CODES
142800***************************************************************** 13480001
142900*      DETERMINE THE PROCESSING SCHEDULE BASED ON TAX MONTH     * 13490001
143000*      VERIFY EACH INPUT HEADER RECORD TO ENSURE CORRECT FILES  * 13500001
143100*      PROCESS THE DETAIL AND TRAILER FOR EACH FILE             * 13510001
143200***************************************************************** 13520001
    EVALUATE TRUE
    WHEN CC-TAX-MM1 = LIT-TAX-MONTH-JAN
       PERFORM 3002-JAN-MONTH-PROCESSING

    WHEN CC-TAX-MM1 > LIT-TAX-MONTH-JAN AND
                    < LIT-TAX-MONTH-YEAR-END
       PERFORM 3004-FEB-DEC-MONTH-PROCESSING

    WHEN CC-TAX-MM1 > LIT-TAX-MONTH-DEC
       PERFORM 3006-YEAR-END-PROCESSING
    END-EVALUATE
    .
    EJECT
144600***************************************************************** 13660001
3002-JAN-MONTH-PROCESSING.
144800***************************************************************** 13680001
144900*   PROCESSING SCHEDULE FOR JANUARY                             * 13690001
145000***************************************************************** 13700001
       PERFORM 4000-MISC-FORM-VERIFY-PROCESS
       PERFORM 4200-BCCW-VERIFY-PROCESS
       PERFORM 4300-DEFT-VERIFY-PROCESS
       IF ERROR-FLAG = "Y"
          MOVE LIT-ERROR-FLAG-EQUALS-YES TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          PERFORM 9998-COREDUMP
       END-IF
       PERFORM 5000-MISC-FORM-PROCESS
       PERFORM 5200-BCCW-PROCESS
       PERFORM 5400-DEFT-PROCESS
       .
EJECT
146400***************************************************************** 13840001
3004-FEB-DEC-MONTH-PROCESSING.
146600***************************************************************** 13860001
146700*   PROCESSING SCHEDULE FOR FEBRUARY THROUGH DECEMBER           * 13870001
146800***************************************************************** 13880001
       PERFORM 4000-MISC-FORM-VERIFY-PROCESS
       PERFORM 4200-BCCW-VERIFY-PROCESS
       PERFORM 4300-DEFT-VERIFY-PROCESS
       PERFORM 4500-REJ-CYCLE-VERIFY-PROCESS

       IF ERROR-FLAG = "Y"
          MOVE LIT-ERROR-FLAG-EQUALS-YES TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          PERFORM 9998-COREDUMP
       END-IF
       PERFORM 5000-MISC-FORM-PROCESS
       PERFORM 5200-BCCW-PROCESS
       PERFORM 5400-DEFT-PROCESS
       PERFORM 5500-REJ-CYCLE-PROCESS
       .
EJECT
148500***************************************************************** 14050001
3006-YEAR-END-PROCESSING.
148700***************************************************************** 14070001
148800*   PROCESSING SCHEDULE FOR YEAR-END                            * 14080001
148900***************************************************************** 14090001
       PERFORM 4000-MISC-FORM-VERIFY-PROCESS
       PERFORM 4500-REJ-CYCLE-VERIFY-PROCESS
       IF ERROR-FLAG = "Y"
          MOVE LIT-ERROR-FLAG-EQUALS-YES TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          PERFORM 9998-COREDUMP
       END-IF
       PERFORM 5000-MISC-FORM-PROCESS
       PERFORM 5500-REJ-CYCLE-PROCESS
       .
EJECT
150100***************************************************************** 14210001
4000-MISC-FORM-VERIFY-PROCESS.
150300***************************************************************** 14230001
150400*   TEST MISCELLANEOUS FORM 20071 INPUT HEADER FOR BAD HEADER   * 14240001
150500*   OR BAD CONTROL DATE.                                        * 14250001
150600***************************************************************** 14260001
    PERFORM 7000-MISC-FORM-READ-RCD
    IF TEN99-T01R-MISC-FORM-EOF-YES
       MOVE LIT-MISC-FORM TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA   TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE "Y" TO ERROR-FLAG
    ELSE
       IF WS-T01R-MISC-FORM-HDR-VALUE = LOW-VALUES AND
          WS-T01R-MISC-FORM-HDR-NAME  = LIT-MISC-FORM-HDR
          IF WS-T01R-MISC-FORM-HDR-YY = CC-TAX-YY1 AND
             WS-T01R-MISC-FORM-HDR-MM = CC-TAX-MM1
             CONTINUE
          ELSE
             MOVE LIT-MISC-FORM      TO MSG-FILE-NAME
             MOVE MSG-INCORRECT-DATE TO CC-E01W-DISPLAY-RCD
             PERFORM 8999-WRITE-SYSOUT
             MOVE "Y" TO ERROR-FLAG
          END-IF
       ELSE
          MOVE LIT-MISC-FORM TO MSG-FILE-ID
          MOVE MSG-BAD-FILE  TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE "Y" TO ERROR-FLAG
       END-IF
    END-IF
    .
    EJECT
153400***************************************************************** 14540001
153500***************************************************************** 14550001
4200-BCCW-VERIFY-PROCESS.
153700***************************************************************** 14570001
153800*   TEST B&CCW FILE FOR NO HEADER OR BAD CONTROL DATE           * 14580001
153900***************************************************************** 14590001
    PERFORM 7200-BCCW-READ-RCD
    IF TEN99-T03R-BCCW-EOF-YES
       MOVE LIT-BCCW    TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
       MOVE "Y"         TO ERROR-FLAG
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       PERFORM 4210-BCCW-VERIFY UNTIL
          END-OF-BCCW-HEADERS-YES OR
          END-OF-BCCW-DETAIL-YES
    END-IF
    .
    EJECT
155300***************************************************************** 14730001
4210-BCCW-VERIFY.
155500***************************************************************** 14750001
155600*   TEST THE MULTIPLE HEADERS FOR NO DATA OR                    * 14760001
155700*   BAD CONTROL DATE                                            * 14770001
155800***************************************************************** 14780001
    IF WS-T03R-BCCW-HDR-ID        = LIT-BCCW-FILE
       IF WS-T03R-BCCW-HDR-YY = CC-TAX-YY1 AND
          WS-T03R-BCCW-HDR-CC = CC-TAX-CC1 AND
          WS-T03R-BCCW-HDR-MM = CC-TAX-MM1
          CONTINUE
       ELSE
          MOVE LIT-BCCW           TO MSG-FILE-NAME
          MOVE MSG-INCORRECT-DATE TO CC-E01W-DISPLAY-RCD
          MOVE "Y"                TO ERROR-FLAG
          PERFORM 8999-WRITE-SYSOUT
       END-IF
    ELSE
       MOVE LIT-BCCW     TO MSG-FILE-ID
       MOVE MSG-BAD-FILE TO CC-E01W-DISPLAY-RCD
       MOVE "Y"          TO ERROR-FLAG
       PERFORM 8999-WRITE-SYSOUT
    END-IF
    PERFORM 7200-BCCW-READ-RCD
    .
    EJECT
157900***************************************************************** 14990001
4300-DEFT-VERIFY-PROCESS.
158100***************************************************************** 15010001
158200*   TEST DEFT  FILE FOR NO HEADER OR BAD CONTROL DATE           * 15020001
158300***************************************************************** 15030001
    PERFORM 7300-DEFT-READ-RCD
    IF TEN99-T04R-DEFT-EOF-YES
       MOVE LIT-DEFT    TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
       MOVE "Y"         TO ERROR-FLAG
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       PERFORM 4310-DEFT-VERIFY
          UNTIL END-OF-DEFT-HEADERS-YES OR
                END-OF-DEFT-DETAIL-YES
    END-IF
    .
    EJECT
159700***************************************************************** 15170001
4310-DEFT-VERIFY.
159900***************************************************************** 15190001
160000*   TEST THE HEADER FOR NO DATA OR BAD CONTROL DATE             * 15200001
160100***************************************************************** 15210001
    IF WS-T04R-DEFT-HDR-ID    = LIT-DEFT-FILE
       IF WS-T04R-DEFT-HDR-YY = CC-TAX-YY1 AND
          WS-T04R-DEFT-HDR-CC = CC-TAX-CC1 AND
          WS-T04R-DEFT-HDR-MM = CC-TAX-MM1
          CONTINUE
       ELSE
          MOVE LIT-DEFT           TO MSG-FILE-NAME
          MOVE MSG-INCORRECT-DATE TO CC-E01W-DISPLAY-RCD
          MOVE "Y"                TO ERROR-FLAG
          PERFORM 8999-WRITE-SYSOUT
       END-IF
    ELSE
       MOVE LIT-DEFT              TO MSG-FILE-ID
       MOVE MSG-BAD-FILE          TO CC-E01W-DISPLAY-RCD
       MOVE "Y"                   TO ERROR-FLAG
       PERFORM 8999-WRITE-SYSOUT
    END-IF
    PERFORM 7300-DEFT-READ-RCD
    .
    EJECT
162200***************************************************************** 15420001
4500-REJ-CYCLE-VERIFY-PROCESS.
162400***************************************************************** 15440001
162500*   TEST FOR EMPTY FILE OR BAD CONTROL DATE                     * 15450001
162600***************************************************************** 15460001
    PERFORM 7500-REJ-CYCLE-READ-RCD
    IF TEN99-T05R-REJ-CYCLE-EOF-YES
       MOVE LIT-REJECT-FILE TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
       MOVE "Y"         TO ERROR-FLAG
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       IF WS-T05R-REJ-CYCLE-HDR-VALUE = LOW-VALUES AND
          WS-T05R-REJ-CYCLE-HDR-ID = LIT-TEN99-REJECT-TRANS
          IF WS-T05R-REJ-CYCLE-HDR-YY = CC-TAX-YY1 AND
             WS-T05R-REJ-CYCLE-HDR-CC = CC-TAX-CC1 AND
             WS-T05R-REJ-CYCLE-HDR-MM = CC-TAX-MM1
             CONTINUE
          ELSE
             MOVE LIT-REJECT-FILE    TO MSG-FILE-NAME
             MOVE MSG-INCORRECT-DATE TO CC-E01W-DISPLAY-RCD
             MOVE "Y"                TO ERROR-FLAG
             PERFORM 8999-WRITE-SYSOUT
          END-IF
       ELSE
          MOVE LIT-REJECT-FILE TO MSG-FILE-ID
          MOVE MSG-BAD-FILE    TO CC-E01W-DISPLAY-RCD
          MOVE "Y"             TO ERROR-FLAG
          PERFORM 8999-WRITE-SYSOUT
       END-IF
    END-IF
    .
    EJECT
165500***************************************************************** 15750001
5000-MISC-FORM-PROCESS.
165700***************************************************************** 15770001
165800*      PRIMING READ AND EOF TEST FOR MISC FORM INPUT            * 15780001
165900***************************************************************** 15790001
    INITIALIZE WS-MISC-FORM-SEQ-CNT
    PERFORM 6500-INITIAL-OUTPUT-COUNT
    PERFORM 7000-MISC-FORM-READ-RCD
166300***************************************************************** 15830001
166400*   TEST FOR NO DATA ON FILE                                    * 15840001
166500***************************************************************** 15850001
    IF TEN99-T01R-MISC-FORM-EOF-YES OR
       WS-T01R-MISC-FORM-TRL-VALUE = HIGH-VALUES
      MOVE LIT-MISC-FORM TO MSG-NO-DATA-FILE-NAME
      MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
      PERFORM 8999-WRITE-SYSOUT
      PERFORM 5040-MISC-FORM-RESULTS-PROCESS
    ELSE
      PERFORM 5010-MISC-FORM-PROCESS-RCD UNTIL
              TEN99-T01R-MISC-FORM-EOF-YES  OR
              WS-T01R-MISC-FORM-TRL-VALUE = HIGH-VALUES
      PERFORM 5040-MISC-FORM-RESULTS-PROCESS
    END-IF
    .

    EJECT
168100***************************************************************** 16010001
5010-MISC-FORM-PROCESS-RCD.
168300***************************************************************** 16030001
168400*   PROCESS THE DETAIL AND TRAILER FOR THE MISC FORM INPUT        16040001
168500*   INCREMENT COUNTERS FOR TRAILER TESTING                        16050001
168600***************************************************************** 16060001
    ADD 1 TO WS-MISC-FORM-TRANS-COUNTER
    ADD WS-T01R-MISC-FORM-AMT TO WS-MISC-FORM-TRANS-AMT-ACCUM
    PERFORM 5020-MISC-FORM-EDIT
    PERFORM 5030-MISC-FORM-WRITE-TRANS-RCD
    PERFORM 7000-MISC-FORM-READ-RCD
    .

EJECT
169500***************************************************************** 16150001
5020-MISC-FORM-EDIT.
169700***************************************************************** 16170001
169800*      BUILD THE UNIVERSAL RECORD                               * 16180001
169900***************************************************************** 16190001
    INITIALIZE REJECT-INDICATORS
    ADD LIT-1 TO WS-MISC-FORM-SEQ-CNT
    MOVE LIT-M                         TO WS-T01W-CHECK-PREFIX
    MOVE CC-TAX-MM1                    TO WS-T01W-CHECK-MONTH
    MOVE WS-MISC-FORM-SEQ-CNT          TO WS-T01W-CHECK-SEQ
    MOVE WS-T01W-CHECK-NUM-KEY         TO WS-T01W-CHECK-NUM
    MOVE WS-T01R-MISC-FORM-BRANCH      TO WS-T01W-BRANCH
    MOVE WS-T01R-MISC-FORM-NAME        TO WS-T01W-NAME
    MOVE WS-T01R-MISC-FORM-ADDR-1      TO WS-T01W-ADDR-1
    MOVE WS-T01R-MISC-FORM-ADDR-2      TO WS-T01W-ADDR-2
    MOVE WS-T01R-MISC-FORM-CITY        TO WS-T01W-CITY
    MOVE WS-T01R-MISC-FORM-STATE       TO WS-T01W-STATE
    MOVE WS-T01R-MISC-FORM-POSTCODE    TO WS-T01W-POSTCODE
    MOVE WS-T01R-MISC-FORM-SSN         TO WS-T01W-SSN-US
    MOVE WS-T01R-MISC-FORM-OPER-LOC    TO WS-T01W-OPER-LOC
    MOVE WS-T01R-MISC-FORM-DESCRIPTION TO WS-T01W-COMMENT
    MOVE WS-T01R-MISC-FORM-AMT         TO WS-T01W-TOTAL-AMT
    MOVE WS-T01R-MISC-FORM-AMT         TO WS-T01W-1099-AMT
    MOVE WS-T01R-MISC-FORM-TAX-TYPE    TO WS-T01W-TAX-TYPE
    MOVE WS-T01R-MISC-FORM-TIN-IND     TO WS-T01W-TIN-IND
    EVALUATE TRUE
    WHEN WS-T01R-MISC-FORM-AMT = LIT-ZERO
       MOVE "Y"        TO REJECT-AMOUNT
       MOVE "Y"        TO REJECT-FLAG
    WHEN WS-T01R-MISC-FORM-AMT NOT NUMERIC
       MOVE "Y"        TO REJECT-AMOUNT
       MOVE "Y"        TO REJECT-FLAG
    END-EVALUATE
    PERFORM 6000-GENERAL-EDIT-PROCESS
    .

EJECT
173200***************************************************************** 16500001
5030-MISC-FORM-WRITE-TRANS-RCD.
173400***************************************************************** 16520001
173500*   SETUP AND WRITE OUTPUT RECORD                               * 16530001
173600***************************************************************** 16540001
    EVALUATE TRUE
    WHEN FOREIGN-INDICATOR-NO
       MOVE LIT-MISC-FORM TO WS-T01W-SOURCE-CODE
       IF REJECT-FLAG = SPACES
          PERFORM 8010-WRITE-TRANS-RCD
       ELSE
          INITIALIZE WS-T02W-REJECT-RECYCLING-RCD
                     WS-C01W-REJ-RPT-OUTPUT-RCD
          MOVE LIT-MISC-FORM TO WS-T02W-REJECT-SOURCE-CODE
          MOVE LIT-MISC-FORM TO WS-C01W-REJ-RPT-SOURCE-CODE
          MOVE WS-T01W-OPER-LOC TO WS-T02W-REJECT-KEY-OP-LOC
          MOVE WS-T01W-OPER-LOC TO WS-C01W-REJ-RPT-KEY-OP-LOC
          MOVE WS-T01W-BRANCH TO WS-T02W-REJECT-KEY-BR-DEPT-CD
          MOVE WS-T01W-BRANCH TO WS-C01W-REJ-RPT-KEY-BR-DEPT-CD
          MOVE WS-T01W-CHECK-DATE TO
               WS-T02W-REJECT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-DATE TO
               WS-C01W-REJ-RPT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-NUM TO
               WS-T02W-REJECT-KEY-CHECK-NUM
          MOVE WS-T01W-CHECK-NUM TO
               WS-C01W-REJ-RPT-KEY-CHECK-NUM
          MOVE WS-T01R-MISC-FORM-RCD TO WS-T02W-REJECT-DETAIL
          MOVE WS-T01W-OUTPUT-DETAIL TO WS-C01W-REJ-RPT-DETAIL
          PERFORM 8020-WRITE-REJECT-TRANS-RCD
          PERFORM 8030-WRITE-REJECT-REPORT-RCD
       END-IF
    WHEN FOREIGN-INDICATOR-CDN
       INITIALIZE WS-T03W-FOR-OUTPUT-RCD
       MOVE LIT-MISC-FORM TO WS-T03W-FOR-SOURCE-CODE
       MOVE LIT-CANADA    TO WS-T03W-FOREIGN-COUNTRY
       MOVE WS-T01R-MISC-FORM-RCD TO WS-T03W-FOR-DETAIL
       PERFORM 8040-WRITE-FOR-TRANS-RCD
    WHEN FOREIGN-INDICATOR-PR
       INITIALIZE WS-T03W-FOR-OUTPUT-RCD
       MOVE LIT-MISC-FORM TO WS-T03W-FOR-SOURCE-CODE
       MOVE LIT-PUERTO-RICO TO WS-T03W-FOREIGN-COUNTRY
       MOVE WS-T01R-MISC-FORM-RCD TO WS-T03W-FOR-DETAIL
       PERFORM 8040-WRITE-FOR-TRANS-RCD
    WHEN OTHER
       INITIALIZE WS-T03W-FOR-OUTPUT-RCD
       MOVE LIT-MISC-FORM TO WS-T03W-FOR-SOURCE-CODE
       MOVE WS-T01R-MISC-FORM-RCD TO WS-T03W-FOR-DETAIL
       PERFORM 8040-WRITE-FOR-TRANS-RCD
    END-EVALUATE
    .
EJECT
178400***************************************************************** 17020001
5040-MISC-FORM-RESULTS-PROCESS.
178600***************************************************************** 17040001
178700*      DISPLAY TRAILER RESULTS                                  * 17050001
178800***************************************************************** 17060001
    IF WS-MISC-FORM-TRANS-COUNTER   =
       WS-T01R-MISC-FORM-TRL-COUNT      AND
       WS-MISC-FORM-TRANS-AMT-ACCUM =
       WS-T01R-MISC-FORM-TRL-AMOUNT
        MOVE LIT-MISC-INPUT-SUCCESS   TO CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        PERFORM 8999-WRITE-SYSOUT
        MOVE WS-MISC-FORM-TRANS-COUNTER TO MSG-MISC-FILE-COUNT
        MOVE WS-MISC-FORM-TRANS-AMT-ACCUM TO MSG-MISC-FILE-AMOUNT17150001
        MOVE MSG-MISC-FORM-SUMMARY TO CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        PERFORM 8999-WRITE-SYSOUT
        MOVE LIT-MISC-FORM-CONTROL-TOTALS TO CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        PERFORM 6600-OUTPUT-BALANCING-PROCESS
    END-IF
    IF WS-MISC-FORM-TRANS-COUNTER   =
       WS-T01R-MISC-FORM-TRL-COUNT
        CONTINUE
    ELSE
        MOVE LIT-TRANS-TLS-DO-NOT-AGREE  TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        MOVE LIT-FOR-MISCELLANEOUS-INPUT TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        MOVE WS-MISC-FORM-TRANS-COUNTER  TO MSG-FILE-COUNT
        MOVE WS-T01R-MISC-FORM-TRL-COUNT TO MSG-TRAILER-COUNT
        MOVE MSG-TRAILER-COUNT-DISPLAY TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
    END-IF
    IF WS-MISC-FORM-TRANS-AMT-ACCUM =
       WS-T01R-MISC-FORM-TRL-AMOUNT
        CONTINUE
    ELSE
        MOVE LIT-TRANS-TLS-DO-NOT-AGREE   TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        MOVE LIT-FOR-MISCELLANEOUS-INPUT  TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
        MOVE WS-MISC-FORM-TRANS-AMT-ACCUM TO MSG-FILE-COUNT
        MOVE WS-T01R-MISC-FORM-TRL-AMOUNT TO MSG-TRAILER-COUNT
        MOVE MSG-TRAILER-COUNT-DISPLAY    TO
             CC-E01W-DISPLAY-RCD
        PERFORM 8999-WRITE-SYSOUT
    END-IF
    MOVE "Y" TO TEN99-T01R-MISC-FORM-EOF
    .
EJECT
184000***************************************************************** 17580001
5200-BCCW-PROCESS.
184200***************************************************************** 17600001
184300*      PRIMING READ AND EOF TEST FOR B&CCW INPUT                * 17610001
184400***************************************************************** 17620001
    PERFORM 6500-INITIAL-OUTPUT-COUNT
184600***************************************************************** 17640001
184700*   TEST FOR NO DATA ON FILE                                    * 17650001
184800***************************************************************** 17660001
    IF TEN99-T03R-BCCW-EOF-YES OR
       END-OF-BCCW-DETAIL-YES
       MOVE LIT-BCCW    TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 5240-BCCW-TRAILER-PROCESS
       MOVE "Y"         TO ERROR-FLAG
    ELSE
       MOVE WS-T03R-BCCW-CHECK-NUM      TO WS-BCCW-CHECK-NUM
       MOVE WS-T03R-BCCW-TAX-TYPE       TO WS-BCCW-TAX-TYPE
       MOVE WS-T03R-BCCW-TIN-IND        TO WS-BCCW-TIN-IND
       PERFORM 5220-BCCW-EDIT
       SET DISB-INDEX TO 1
       PERFORM 5210-BCCW-PROCESS-RCD UNTIL
          WS-T03R-BCCW-TRL-VALUE = HIGH-VALUES
       PERFORM 5230-BCCW-WRITE-TRANS-RCD
       PERFORM 5240-BCCW-TRAILER-PROCESS
    END-IF
    .
EJECT
186900***************************************************************** 17850001
5210-BCCW-PROCESS-RCD.
187100***************************************************************** 17870001
187200*      PROCESS THE DETAIL AND TRAILER FOR THE B&CCW ISSUES      * 17880001
187300*      FIRST TIME THROUGH CHECK FOR NO DATA                     * 17890001
187400*      INCREMENT COUNTERS FOR PRIMING READ                      * 17900001
187500*      PROCESS THE DETAIL AND TRAILER FOR THE B&CCW ISSUES      * 17910001
187600*                                                               * 17920001
187700*      PROCESS RECORDS UNTIL THE KEY CHANGES.                   * 17930001
187800*      KEY => CHECK NUM, TAX TYPE, TIN                          * 17930001
187900*      THERE MAY BE MULTIPLE RECORDS FOR EACH CHECK NUMBER.     * 17940001
188000***************************************************************** 17950001
    IF WS-T03R-BCCW-CHECK-NUM = WS-BCCW-CHECK-NUM
       IF (WS-BCCW-TAX-TYPE = WS-T03R-BCCW-TAX-TYPE)
           OR (WS-BCCW-TAX-TYPE = SPACE AND
                  WS-T03R-BCCW-TAX-TYPE > SPACE)
          IF WS-T03R-BCCW-TIN-IND = WS-BCCW-TIN-IND
               PERFORM 5215-BCCW-DIST-CNTL
          ELSE
               PERFORM 5230-BCCW-WRITE-TRANS-RCD
               SET DISB-INDEX TO 1
               PERFORM 5220-BCCW-EDIT
               PERFORM 5215-BCCW-DIST-CNTL
          END-IF
       ELSE
            PERFORM 5230-BCCW-WRITE-TRANS-RCD
            SET DISB-INDEX TO 1
            PERFORM 5220-BCCW-EDIT
            PERFORM 5215-BCCW-DIST-CNTL
       END-IF
    ELSE
       IF WS-T03R-BCCW-TRL-VALUE = HIGH-VALUES
          PERFORM 5230-BCCW-WRITE-TRANS-RCD
          PERFORM 5240-BCCW-TRAILER-PROCESS
       ELSE
          PERFORM 5230-BCCW-WRITE-TRANS-RCD
          SET DISB-INDEX TO 1
          PERFORM 5220-BCCW-EDIT
          PERFORM 5215-BCCW-DIST-CNTL
       END-IF
    END-IF
    .
EJECT

5215-BCCW-DIST-CNTL.
191400***************************************************************** 18130001
191500*      CONTROL THE PROCESSING TO COMBINE AND WRITE              * 18140001
191600*      TRANSACTION RECORDS.                                     * 18150001
191700***************************************************************** 18160001
191800***************************************************************** 18350001
191900* IF THE COMPASS CODE IS EQUAL TO SPACES AND THE RECORD         * 18360001
192000* IS FROM INSURANCE - DO NOT ADD TO THE 1099 AMOUNT. SHOULD BE  * 18370001
192100* REPORTED ON THE EXCLUDE FILE. EFFECTIVE WITH THE 2010 TAX     * 18370001
192200* YEAR - INSURANCE/RWS IS NOT 1099 ELIGIBLE.                    * 18370001
192300*                                                               *
192400* IF THE COMPASS CODE IS EQUAL TO SPACES AND THE RECORD         * 18360001
192500* IS FROM SPECIAL CHECK PROCESSING - CLOC BRANCH CODE = 048     * 18370001
192600* THE CHECK IS 1099 ELIGIBLE.                                   * 18370001
192700*                                                               *
192800* IF THERE IS A COMPASS CODE, THE PROGRAM SEARCHES THE          * 18370001
192900* 1099 ENTRY CODE TABLE TO DETERMINE WHETHER THE RECORD         * 18380001
193000* IS 1099 REPORTABLE                                            * 18390001
193100***************************************************************** 18400001
           ADD WS-T03R-BCCW-DISB-AMT TO WS-T01W-TOTAL-AMT
           ADD WS-T03R-BCCW-DISB-AMT TO
               WS-BCCW-TRANS-AMT-ACCUM
           ADD LIT-1 TO WS-T01W-NBR-DIST-RCD
           ADD LIT-1 TO WS-BCCW-TRANS-COUNTER
193700***************************************************************** 18220001
193800*        IF THE NUMBER OF DISBURSEMENTS IS GREATER THAN 5       * 18230001
193900*        ACCUMULATE THE DATA FOR THE REMAINING DISBURSEMENTS    * 18240001
194000*        IN THE 5TH BUCKET.                                     * 18250001
194100*                                                               * 18260001
194200*   3/17/97 -                                                   * 18270001
194300*        SET WS-T01W-NBR-DIST-RCD TO 5 - DO NOT CHANGE THIS -   * 18280001
194400*        THIS CODE PREVENTS A SOC7 - WS-T01W-DIST-RCD AREA CAN  * 18290001
194500*        ONLY HAVE 5 OCCURENCES - THE WS-T01W-NBR-DIST-RCD IS   * 18300001
194600*        USED TO ACCESS THE WS-T01W-DIST-RCD AREA.              * 18310001
194700***************************************************************** 18320001
    IF DISB-INDEX > 5
       MOVE  5     TO WS-T01W-NBR-DIST-RCD
       IF WS-T03R-BCCW-COMPASS-CODE = SPACES
          IF WS-T03R-BCCW-CLOC-BR-CODE
             ADD WS-T03R-BCCW-DISB-AMT TO
                 WS-T01W-DIST-AMT(LIT-5)
             ADD WS-T03R-BCCW-DISB-AMT TO
                 WS-T01W-1099-AMT
          ELSE
             CONTINUE
          END-IF
       ELSE
          SET CODE-INDEX TO 1
          SEARCH WS-T07R-1099ENTRY-CODES
            AT END
              CONTINUE
            WHEN WS-T03R-BCCW-COMPASS-CODE =
               WS-T07R-1099ENTRY-CODE(CODE-INDEX)
              IF WS-T01W-DIST-1099-INDIC(LIT-5) = "Y"
                 CONTINUE
              ELSE
                 MOVE "Y" TO WS-T01W-DIST-1099-INDIC(LIT-5)
                 MOVE WS-T03R-BCCW-COMPASS-CODE TO
                    WS-T01W-DIST-COMPASS-CODE(LIT-5)
              END-IF
            ADD WS-T03R-BCCW-DISB-AMT TO
                WS-T01W-1099-AMT
          END-SEARCH
          ADD WS-T03R-BCCW-DISB-AMT TO
            WS-T01W-DIST-AMT(LIT-5)
       END-IF
    ELSE
       MOVE WS-T03R-BCCW-DISB-AMT TO
               WS-T01W-DIST-AMT(DISB-INDEX)
       MOVE WS-T03R-BCCW-COMPASS-CODE TO
               WS-T01W-DIST-COMPASS-CODE (DISB-INDEX)
       IF WS-T03R-BCCW-COMPASS-CODE = SPACES
          IF WS-T03R-BCCW-CLOC-BR-CODE
              ADD WS-T03R-BCCW-DISB-AMT TO
                  WS-T01W-1099-AMT
              MOVE "Y" TO WS-T01W-DIST-1099-INDIC(DISB-INDEX)
          ELSE
              CONTINUE
          END-IF
       ELSE
           SET CODE-INDEX TO 1
           SEARCH WS-T07R-1099ENTRY-CODES
            AT END
              MOVE SPACES TO WS-T01W-DIST-1099-INDIC(DISB-INDEX)
            WHEN WS-T01W-DIST-COMPASS-CODE(DISB-INDEX) =
              WS-T07R-1099ENTRY-CODE(CODE-INDEX)
            MOVE "Y" TO WS-T01W-DIST-1099-INDIC(DISB-INDEX)
            ADD WS-T01W-DIST-AMT(DISB-INDEX)
              TO WS-T01W-1099-AMT
           END-SEARCH
       END-IF
    END-IF
    SET DISB-INDEX UP BY 1
    MOVE WS-T03R-BCCW-CHECK-NUM TO WS-BCCW-CHECK-NUM
    MOVE WS-T03R-BCCW-TIN-IND   TO WS-BCCW-TIN-IND
    IF (WS-BCCW-TAX-TYPE = SPACE) AND (WS-T03R-VALID-TAX-TYPE)
       MOVE WS-T03R-BCCW-TAX-TYPE TO WS-T01W-TAX-TYPE
    END-IF
    MOVE WS-T03R-BCCW-TAX-TYPE  TO WS-BCCW-TAX-TYPE
    PERFORM 7200-BCCW-READ-RCD
    .

EJECT
201600***************************************************************** 18940001
5220-BCCW-EDIT.
201800***************************************************************** 18960001
201900*      BUILD THE UNIVERSAL RECORD                               * 18970001
202000***************************************************************** 18980001
    INITIALIZE SW-BCCW-BUILD-COMPLETE
    MOVE CC-TAX-MM1                   TO   WS-T01W-CHECK-DATE-MM
    MOVE CC-TAX-DD1                   TO   WS-T01W-CHECK-DATE-DD
    MOVE CC-TAX-YY1                   TO   WS-T01W-CHECK-DATE-YY
    MOVE CC-TAX-CC1                   TO   WS-T01W-CHECK-DATE-CC
    MOVE WS-T03R-BCCW-BRANCH-CODE TO       WS-T01W-BRANCH
    MOVE WS-T03R-BCCW-NAME            TO   WS-T01W-NAME
    MOVE WS-T03R-BCCW-ADDRESS-1       TO   WS-T01W-ADDR-1
    MOVE WS-T03R-BCCW-ADDRESS-2       TO   WS-T01W-ADDR-2
    MOVE WS-T03R-BCCW-CITY            TO   WS-T01W-CITY
    MOVE WS-T03R-BCCW-STATE           TO   WS-T01W-STATE
    MOVE WS-T03R-BCCW-ZIPCODE         TO   WS-T01W-POSTCODE
    MOVE WS-T03R-BCCW-SSN             TO   WS-T01W-SSN-US
    MOVE WS-T03R-BCCW-OP-LOC          TO   WS-T01W-OPER-LOC
    MOVE WS-T03R-BCCW-DESC            TO   WS-T01W-COMMENT
    MOVE WS-T03R-BCCW-CHECK-NUM       TO   WS-T01W-CHECK-NUM
    MOVE WS-T03R-BCCW-CHECK-NUM       TO   WS-T01W-CHECK-NUM-KEY
                                           WS-BCCW-CHECK-NUM
    MOVE WS-T03R-BCCW-TIN-IND         TO   WS-T01W-TIN-IND
                                           WS-BCCW-TIN-IND
    MOVE WS-T03R-BCCW-TAX-TYPE        TO   WS-T01W-TAX-TYPE
                                           WS-BCCW-TAX-TYPE

    EVALUATE TRUE
      WHEN WS-T03R-BCCW-DISB-AMT = LIT-ZERO
        IF WS-T03R-VALID-TAX-TYPE
            CONTINUE
        ELSE
         MOVE "Y"        TO REJECT-AMOUNT
         MOVE "Y"        TO REJECT-FLAG
        END-IF
      WHEN WS-T03R-BCCW-DISB-AMT NOT NUMERIC
         MOVE "Y"        TO REJECT-AMOUNT
         MOVE "Y"        TO REJECT-FLAG
      WHEN OTHER
         CONTINUE
    END-EVALUATE
    PERFORM 6000-GENERAL-EDIT-PROCESS
    .

EJECT
206200***************************************************************** 19310001
5230-BCCW-WRITE-TRANS-RCD.
206400***************************************************************** 19330001
206500*   SETUP AND WRITE OUTPUT RECORD                               * 19340001
206600***************************************************************** 19350001
    IF FOREIGN-INDICATOR-NO
       MOVE LIT-BCCW TO WS-T01W-SOURCE-CODE
       IF REJECT-FLAG = SPACES
          SET DISB-INDEX TO 1
          IF WS-T01W-1099-AMT = LIT-ZERO
             PERFORM 8050-WRITE-EXCLUDES-RCD
             INITIALIZE WS-T01W-NBR-DIST-RCD
          ELSE
             PERFORM 8010-WRITE-TRANS-RCD
             INITIALIZE WS-T01W-NBR-DIST-RCD
          END-IF
       ELSE
          INITIALIZE WS-T02W-REJECT-RECYCLING-RCD
                     WS-C01W-REJ-RPT-OUTPUT-RCD
          MOVE LIT-BCCW      TO WS-T02W-REJECT-SOURCE-CODE
          MOVE LIT-BCCW      TO WS-C01W-REJ-RPT-SOURCE-CODE
          MOVE WS-T01W-OPER-LOC TO WS-T02W-REJECT-KEY-OP-LOC
          MOVE WS-T01W-OPER-LOC TO WS-C01W-REJ-RPT-KEY-OP-LOC
          MOVE WS-T01W-BRANCH TO WS-T02W-REJECT-KEY-BR-DEPT-CD
          MOVE WS-T01W-BRANCH TO WS-C01W-REJ-RPT-KEY-BR-DEPT-CD
          MOVE WS-T01W-CHECK-DATE TO
               WS-T02W-REJECT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-DATE TO
               WS-C01W-REJ-RPT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-NUM TO
               WS-T02W-REJECT-KEY-CHECK-NUM
          MOVE WS-T01W-CHECK-NUM TO
               WS-C01W-REJ-RPT-KEY-CHECK-NUM
          MOVE WS-T01W-TAX-TYPE  TO
               WS-C01W-REJ-RPT-TAX-TYPE
               WS-T02W-REJECT-TAX-TYPE
          MOVE WS-T01W-TIN-IND   TO
               WS-C01W-REJ-RPT-TIN-IND
               WS-T02W-REJECT-TIN-IND
          MOVE WS-T01W-OUTPUT-DETAIL    TO
               WS-T02W-REJECT-DETAIL
          MOVE WS-T01W-OUTPUT-DETAIL TO WS-C01W-REJ-RPT-DETAIL
          SET DISB-INDEX TO 1
          PERFORM 8020-WRITE-REJECT-TRANS-RCD
          PERFORM 8030-WRITE-REJECT-REPORT-RCD
          INITIALIZE WS-T01W-NBR-DIST-RCD
       END-IF
    ELSE
       INITIALIZE WS-T03W-FOR-OUTPUT-RCD
       MOVE LIT-BCCW TO WS-T03W-FOR-SOURCE-CODE
       MOVE WS-T01R-MISC-FORM-RCD TO WS-T03W-FOR-DETAIL
       SET DISB-INDEX TO 1
       PERFORM 8040-WRITE-FOR-TRANS-RCD
       INITIALIZE WS-T01W-NBR-DIST-RCD
    END-IF
    .
EJECT
211900***************************************************************** 19820001
5240-BCCW-TRAILER-PROCESS.
212100***************************************************************** 19840001
212200*      TEST TRAILER TOTALS AND DISPLAY RESULTS                  * 19850001
212300***************************************************************** 19860001
    PERFORM 8999-WRITE-SYSOUT
    PERFORM 5250-BCCW-TRAILER-ACCUM UNTIL
       TEN99-T03R-BCCW-EOF-YES
    IF WS-BCCW-TRANS-COUNTER = WS-BCCW-TRL-COUNTER AND
       WS-BCCW-TRANS-AMT-ACCUM = WS-BCCW-TRL-AMT-ACCUM
       MOVE LIT-BCCW-SUCCESS TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-BCCW-TRANS-COUNTER TO MSG-FILE-COUNT
       MOVE WS-BCCW-TRL-COUNTER TO MSG-TRAILER-COUNT
       MOVE MSG-TRAILER-COUNT-DISPLAY TO
            CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-BCCW-TRANS-AMT-ACCUM TO MSG-FILE-AMOUNT
       MOVE WS-BCCW-TRL-AMT-ACCUM TO MSG-TRAILER-AMOUNT
       MOVE MSG-TRAILER-DOLLAR-DISPLAY TO
            CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       IF WS-BCCW-TRANS-COUNTER = WS-BCCW-TRL-COUNTER
          CONTINUE
       ELSE
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-BCCW-INPUT TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-BCCW-TRANS-COUNTER TO MSG-FILE-COUNT
          MOVE WS-BCCW-TRL-COUNTER TO MSG-TRAILER-COUNT
          MOVE MSG-TRAILER-COUNT-DISPLAY TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
       END-IF
       IF WS-BCCW-TRANS-AMT-ACCUM =
          WS-BCCW-TRL-AMT-ACCUM
          CONTINUE
       ELSE
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-BCCW-INPUT TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-BCCW-TRANS-AMT-ACCUM TO MSG-FILE-AMOUNT
          MOVE WS-BCCW-TRL-AMT-ACCUM TO MSG-TRAILER-AMOUNT
          MOVE MSG-TRAILER-DOLLAR-DISPLAY TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
       END-IF
       PERFORM 8999-WRITE-SYSOUT
    END-IF
    MOVE LIT-BCCW-CONTROL-TOTALS TO CC-E01W-DISPLAY-RCD
    PERFORM 8999-WRITE-SYSOUT
    PERFORM 6600-OUTPUT-BALANCING-PROCESS
    PERFORM 8999-WRITE-SYSOUT
    MOVE "Y" TO TEN99-T03R-BCCW-EOF
    .
EJECT
218300***************************************************************** 20460001
5250-BCCW-TRAILER-ACCUM.
218500***************************************************************** 20480001
218600*      ACCUMULATE BCCW TRAILER TOTALS                           * 20490001
218700*      NOTE: THE FILE HAS BEEN SORTED TO INCLUDE MULTIPLE       * 20500001
218800*      HEADERS AND TRAILERS.  FOR THIS REASON, THE TRAILERS     * 20510001
218900*      MUST BE ACCUMULATED TO BALANCE THE DATA.                 * 20520001
219000***************************************************************** 20530001
    ADD WS-T03R-BCCW-TRL-CNT TO WS-BCCW-TRL-COUNTER
    ADD WS-T03R-BCCW-TRL-AMT TO WS-BCCW-TRL-AMT-ACCUM
    PERFORM 7200-BCCW-READ-RCD
    .
EJECT
219600***************************************************************** 20590001

EJECT
219900***************************************************************** 20620001
5400-DEFT-PROCESS.
220100***************************************************************** 20640001
220200*      PRIMING READ AND EOF TEST FOR DEFT  INPUT                * 20650001
220300***************************************************************** 20660001
    PERFORM 6500-INITIAL-OUTPUT-COUNT
220500***************************************************************** 20680001
220600*   TEST FOR NO DATA ON FILE                                    * 20690001
220700***************************************************************** 20700001
    IF TEN99-T04R-DEFT-EOF-YES OR
       END-OF-DEFT-DETAIL-YES
       MOVE LIT-DEFT               TO MSG-NO-DATA-FILE-NAME
       MOVE MSG-NO-DATA            TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 5440-DEFT-TRAILER-PROCESS
    ELSE
       MOVE WS-T04R-DEFT-BATCH-NUM TO WS-DEFT-BATCH-NUM
       MOVE WS-T04R-DEFT-TAX-TYPE  TO WS-DEFT-TAX-TYPE
       MOVE WS-T04R-DEFT-TIN-IND   TO WS-DEFT-TIN-IND
       PERFORM 5420-DEFT-EDIT
       SET DISB-INDEX              TO 1
       PERFORM 5410-DEFT-PROCESS-RCD
         UNTIL WS-T04R-DEFT-TRL-VALUE = HIGH-VALUES
       PERFORM 5430-DEFT-WRITE-TRANS-RCD
       PERFORM 5440-DEFT-TRAILER-PROCESS
    END-IF
    .
EJECT
222700***************************************************************** 20880001
5410-DEFT-PROCESS-RCD.
222900***************************************************************** 20900001
223000*      PROCESS THE DETAIL AND TRAILER FOR THE DEFT  ISSUES      * 20910001
223100*      INCREMENT COUNTERS FOR PRIMING READ                      * 20920001
223200*      PROCESS THE DETAIL AND TRAILER FOR THE DEFT  ISSUES      * 20930001
223300*                                                               * 20940001
223400*      PROCESS RECORDS UNTIL THE BATCH NUMBER CHANGES.          * 20950001
223500*      THERE MAY BE MULTIPLE RECORDS FOR EACH BATCH NUMBER.     * 20960001
223600***************************************************************** 20970001
    IF (WS-T04R-DEFT-BATCH-NUM = WS-DEFT-BATCH-NUM)
        AND (WS-T04R-DEFT-TAX-TYPE = WS-DEFT-TAX-TYPE)
        AND (WS-T04R-DEFT-TIN-IND = WS-DEFT-TIN-IND)
          PERFORM 5415-DEFT-DIST-CNTL
    ELSE
       IF WS-T04R-DEFT-TRL-VALUE = HIGH-VALUES
          PERFORM 5430-DEFT-WRITE-TRANS-RCD
          PERFORM 5440-DEFT-TRAILER-PROCESS
       ELSE
          PERFORM 5430-DEFT-WRITE-TRANS-RCD
          SET DISB-INDEX       TO 1
          PERFORM 5420-DEFT-EDIT
          PERFORM 5415-DEFT-DIST-CNTL
       END-IF
    END-IF
    .
EJECT

5415-DEFT-DIST-CNTL.
225600***************************************************************** 21150001
225700*      CONTROL THE PROCESSING TO COMBINE AND WRITE              * 21160001
225800*      TRANSACTION RECORDS.                                     * 21170001
225900***************************************************************** 21180001
       ADD WS-T04R-DEFT-DISB-AMT     TO WS-T01W-TOTAL-AMT
                                        WS-DEFT-TRANS-AMT-ACCUM
       ADD LIT-1                     TO WS-T01W-NBR-DIST-RCD
                                        WS-DEFT-TRANS-COUNTER
226400***************************************************************** 21230001
226500*        IF THE NUMBER OF DISBURSEMENTS IS GREATER THAN 5       * 21240001
226600*        ACCUMULATE THE DATA FOR THE REMAINING DISBURSEMENTS    * 21250001
226700*        IN THE 5TH BUCKET.                                     * 21260001
226800*                                                               * 21270001
226900*        SET WS-T01W-NBR-DIST-RCD TO 5 - DO NOT CHANGE THIS -   * 21280001
227000*        THIS CODE PREVENTS A SOC7 - WS-T01W-DIST-RCD AREA CAN  * 21290001
227100*        ONLY HAVE 5 OCCURENCES - THE WS-T01W-NBR-DIST-RCD IS   * 21300001
227200*        USED TO ACCESS THE WS-T01W-DIST-RCD AREA.              * 21310001
227300***************************************************************** 21320001
    IF DISB-INDEX > 5
       MOVE  5                            TO WS-T01W-NBR-DIST-RCD21340001
       SET CODE-INDEX TO 1
       SEARCH WS-T07R-1099ENTRY-CODES
           AT END
              CONTINUE
           WHEN WS-T04R-DEFT-COMPASS-CODE =
                WS-T07R-1099ENTRY-CODE(CODE-INDEX)
                IF WS-T01W-DIST-1099-INDIC(LIT-5) = "Y"
                   CONTINUE
                ELSE
                   MOVE "Y"                       TO
                        WS-T01W-DIST-1099-INDIC(LIT-5)
                   MOVE WS-T04R-DEFT-COMPASS-CODE TO
                        WS-T01W-DIST-COMPASS-CODE(LIT-5)
                END-IF
            ADD WS-T04R-DEFT-DISB-AMT             TO
                WS-T01W-1099-AMT
       END-SEARCH
       ADD WS-T04R-DEFT-DISB-AMT                  TO
           WS-T01W-DIST-AMT(LIT-5)
    ELSE
       MOVE WS-T04R-DEFT-DISB-AMT         TO
            WS-T01W-DIST-AMT(DISB-INDEX)
       MOVE WS-T04R-DEFT-COMPASS-CODE     TO
            WS-T01W-DIST-COMPASS-CODE (DISB-INDEX)
       SET CODE-INDEX                     TO 1
       SEARCH WS-T07R-1099ENTRY-CODES
           AT END
              MOVE SPACES                 TO
                   WS-T01W-DIST-1099-INDIC(DISB-INDEX)
              WHEN WS-T01W-DIST-COMPASS-CODE(DISB-INDEX) =
                   WS-T07R-1099ENTRY-CODE(CODE-INDEX)
                   MOVE "Y"               TO
                        WS-T01W-DIST-1099-INDIC(DISB-INDEX)
                   ADD WS-T01W-DIST-AMT(DISB-INDEX)
                                          TO WS-T01W-1099-AMT
       END-SEARCH
    END-IF

    SET DISB-INDEX UP BY 1

    MOVE WS-T04R-DEFT-BATCH-NUM        TO WS-DEFT-BATCH-NUM
    MOVE WS-T04R-DEFT-TIN-IND          TO WS-DEFT-TIN-IND
    MOVE WS-T04R-DEFT-TAX-TYPE         TO WS-DEFT-TAX-TYPE
    PERFORM 7300-DEFT-READ-RCD

         .

EJECT
232400***************************************************************** 21810001
5420-DEFT-EDIT.
232600***************************************************************** 21830001
232700*      BUILD THE UNIVERSAL RECORD                               * 21840001
232800***************************************************************** 21850001
    INITIALIZE SW-DEFT-BUILD-COMPLETE
    MOVE WS-T04R-DEFT-BNK-STLMT-MM    TO   WS-T01W-CHECK-DATE-MM
    MOVE WS-T04R-DEFT-BNK-STLMT-DD    TO   WS-T01W-CHECK-DATE-DD
    MOVE WS-T04R-DEFT-BNK-STLMT-CC    TO   WS-T01W-CHECK-DATE-CC
    MOVE WS-T04R-DEFT-BNK-STLMT-YY    TO   WS-T01W-CHECK-DATE-YY
    MOVE WS-T04R-DEFT-BRANCH-CODE     TO   WS-T01W-BRANCH
    MOVE WS-T04R-DEFT-NAME            TO   WS-T01W-NAME
    MOVE WS-T04R-DEFT-ADDRESS-1       TO   WS-T01W-ADDR-1
    MOVE WS-T04R-DEFT-ADDRESS-2       TO   WS-T01W-ADDR-2
    MOVE WS-T04R-DEFT-CITY            TO   WS-T01W-CITY
    MOVE WS-T04R-DEFT-STATE           TO   WS-T01W-STATE
    MOVE WS-T04R-DEFT-ZIPCODE         TO   WS-T01W-POSTCODE
    MOVE WS-T04R-DEFT-SSN             TO   WS-T01W-SSN-US
    MOVE WS-T04R-DEFT-OP-LOC          TO   WS-T01W-OPER-LOC
    MOVE WS-T04R-DEFT-DESC            TO   WS-T01W-COMMENT
    MOVE WS-T04R-DEFT-BATCH-NUM       TO   WS-T01W-CHECK-NUM
    MOVE WS-T04R-DEFT-BATCH-NUM       TO   WS-T01W-CHECK-NUM-KEY
                                           WS-DEFT-BATCH-NUM
    MOVE WS-T04R-DEFT-TAX-TYPE        TO   WS-T01W-TAX-TYPE
                                           WS-DEFT-TAX-TYPE
    MOVE WS-T04R-DEFT-TIN-IND         TO   WS-T01W-TIN-IND
                                           WS-DEFT-TIN-IND
    MOVE WS-T04R-DEFT-LINE-NBR        TO   WS-T01W-LINE-NBR

    EVALUATE TRUE
    WHEN WS-T04R-DEFT-DISB-AMT = LIT-ZERO
       MOVE "Y"                       TO   REJECT-AMOUNT
                                           REJECT-FLAG
    WHEN WS-T04R-DEFT-DISB-AMT NOT NUMERIC
       MOVE "Y"                       TO   REJECT-AMOUNT
                                           REJECT-FLAG
    WHEN OTHER
       CONTINUE
    END-EVALUATE

    PERFORM 6000-GENERAL-EDIT-PROCESS
    .

EJECT
236800***************************************************************** 22200001
5430-DEFT-WRITE-TRANS-RCD.
237000***************************************************************** 22220001
237100*   SETUP AND WRITE OUTPUT RECORD                               * 22230001
237200***************************************************************** 22240001
237300********************************************************          22250001
    MOVE LIT-DEFT      TO WS-T01W-SOURCE-CODE
    EVALUATE TRUE
    WHEN FOREIGN-INDICATOR-NO
       IF REJECT-FLAG = SPACES
          SET DISB-INDEX TO 1
          IF WS-T01W-1099-AMT = LIT-ZERO
             PERFORM 8050-WRITE-EXCLUDES-RCD
             INITIALIZE WS-T01W-NBR-DIST-RCD
          ELSE
             PERFORM 8010-WRITE-TRANS-RCD
             INITIALIZE WS-T01W-NBR-DIST-RCD
          END-IF
       ELSE
          INITIALIZE WS-T02W-REJECT-RECYCLING-RCD
                     WS-C01W-REJ-RPT-OUTPUT-RCD
          MOVE LIT-DEFT         TO WS-T02W-REJECT-SOURCE-CODE
                                   WS-C01W-REJ-RPT-SOURCE-CODE
          MOVE WS-T01W-OPER-LOC TO WS-T02W-REJECT-KEY-OP-LOC
          MOVE WS-T01W-OPER-LOC TO WS-C01W-REJ-RPT-KEY-OP-LOC
          MOVE WS-T01W-BRANCH   TO WS-T02W-REJECT-KEY-BR-DEPT-CD
          MOVE WS-T01W-BRANCH   TO WS-C01W-REJ-RPT-KEY-BR-DEPT-CD22460001
          MOVE WS-T01W-CHECK-DATE TO
               WS-T02W-REJECT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-DATE TO
               WS-C01W-REJ-RPT-KEY-CHECK-DT
          MOVE WS-T01W-CHECK-NUM  TO
               WS-T02W-REJECT-KEY-CHECK-NUM
          MOVE WS-T01W-CHECK-NUM  TO
               WS-C01W-REJ-RPT-KEY-CHECK-NUM
          MOVE WS-T01W-TAX-TYPE  TO
               WS-C01W-REJ-RPT-TAX-TYPE
               WS-T02W-REJECT-TAX-TYPE
          MOVE WS-T01W-TIN-IND   TO
               WS-C01W-REJ-RPT-TIN-IND
               WS-T02W-REJECT-TIN-IND
          MOVE WS-T01W-OUTPUT-DETAIL    TO
               WS-T02W-REJECT-DETAIL
          MOVE WS-T01W-OUTPUT-DETAIL TO WS-C01W-REJ-RPT-DETAIL
          SET DISB-INDEX TO 1
          PERFORM 8020-WRITE-REJECT-TRANS-RCD
          PERFORM 8030-WRITE-REJECT-REPORT-RCD
       END-IF
    WHEN OTHER
       INITIALIZE WS-T03W-FOR-OUTPUT-RCD
       MOVE LIT-DEFT              TO WS-T03W-FOR-SOURCE-CODE
       MOVE WS-T01R-MISC-FORM-RCD TO WS-T03W-FOR-DETAIL
       SET DISB-INDEX TO 1
       PERFORM 8040-WRITE-FOR-TRANS-RCD
       INITIALIZE WS-T01W-NBR-DIST-RCD
    END-EVALUATE
    .
EJECT
242600***************************************************************** 22720001
5440-DEFT-TRAILER-PROCESS.
242800***************************************************************** 22740001
242900*      TEST TRAILER TOTALS AND DISPLAY RESULTS                  * 22750001
243000***************************************************************** 22760001
    PERFORM 8999-WRITE-SYSOUT

    PERFORM 5450-DEFT-TRAILER-ACCUM
       UNTIL TEN99-T04R-DEFT-EOF-YES

    IF WS-DEFT-TRANS-COUNTER   = WS-DEFT-TRL-COUNTER AND
       WS-DEFT-TRANS-AMT-ACCUM = WS-DEFT-TRL-AMT-ACCUM
       MOVE LIT-DEFT-SUCCESS           TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-DEFT-TRANS-COUNTER      TO MSG-FILE-COUNT
       MOVE WS-DEFT-TRL-COUNTER        TO MSG-TRAILER-COUNT
       MOVE MSG-TRAILER-COUNT-DISPLAY  TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-DEFT-TRANS-AMT-ACCUM    TO MSG-FILE-AMOUNT
       MOVE WS-DEFT-TRL-AMT-ACCUM      TO MSG-TRAILER-AMOUNT
       MOVE MSG-TRAILER-DOLLAR-DISPLAY TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       IF WS-DEFT-TRANS-COUNTER = WS-DEFT-TRL-COUNTER
          CONTINUE
       ELSE
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-DEFT-INPUT         TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-DEFT-TRANS-COUNTER      TO MSG-FILE-COUNT
          MOVE WS-DEFT-TRL-COUNTER        TO MSG-TRAILER-COUNT
          MOVE MSG-TRAILER-COUNT-DISPLAY  TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
       END-IF

       IF WS-DEFT-TRANS-AMT-ACCUM = WS-DEFT-TRL-AMT-ACCUM
          CONTINUE
       ELSE
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-DEFT-INPUT         TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-DEFT-TRANS-AMT-ACCUM    TO MSG-FILE-AMOUNT
          MOVE WS-DEFT-TRL-AMT-ACCUM      TO MSG-TRAILER-AMOUNT
          MOVE MSG-TRAILER-DOLLAR-DISPLAY TO CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
       END-IF
       PERFORM 8999-WRITE-SYSOUT
    END-IF

    MOVE LIT-DEFT-CONTROL-TOTALS          TO CC-E01W-DISPLAY-RCD

    PERFORM 8999-WRITE-SYSOUT
    PERFORM 6600-OUTPUT-BALANCING-PROCESS
    PERFORM 8999-WRITE-SYSOUT

    MOVE "Y"                              TO TEN99-T04R-DEFT-EOF
    .
EJECT
248600***************************************************************** 23320001
5450-DEFT-TRAILER-ACCUM.
248800***************************************************************** 23340001
248900*      ACCUMULATE DEFT TRAILER TOTALS                           * 23350001
249000***************************************************************** 23360001
    ADD WS-T04R-DEFT-TRL-CNT TO WS-DEFT-TRL-COUNTER
    ADD WS-T04R-DEFT-TRL-AMT TO WS-DEFT-TRL-AMT-ACCUM
    PERFORM 7300-DEFT-READ-RCD
    .
EJECT
249600***************************************************************** 23420001
5500-REJ-CYCLE-PROCESS.
249800***************************************************************** 23440001
249900*      PRIMING READ AND EOF TEST FOR REJECT RECYCLED INPUT      * 23450001
250000***************************************************************** 23460001
    PERFORM 6500-INITIAL-OUTPUT-COUNT
    PERFORM 7500-REJ-CYCLE-READ-RCD
    IF TEN99-T05R-REJ-CYCLE-EOF-YES OR
       WS-T05R-REJ-CYCLE-TRL-VALUE = HIGH-VALUES
250500***************************************************************** 23510001
250600*   TEST FOR NO DATA ON FILE                                    * 23520001
250700***************************************************************** 23530001
      MOVE LIT-REJECT-FILE TO MSG-NO-DATA-FILE-NAME
      MOVE MSG-NO-DATA TO CC-E01W-DISPLAY-RCD
      PERFORM 8999-WRITE-SYSOUT
      PERFORM 5540-REJ-CYCLE-TRAILER-PROCESS
    ELSE
      PERFORM 5510-REJ-CYCLE-PROCESS-RCD UNTIL
               TEN99-T05R-REJ-CYCLE-EOF-YES
    END-IF
    .
    EJECT
251800***************************************************************** 23640001
5510-REJ-CYCLE-PROCESS-RCD.
252000***************************************************************** 23660001
252100*      PROCESS THE DETAIL AND TRAILER FOR REJECT RECYCLED INPUT * 23670001
252200***************************************************************** 23680001
    IF WS-T05R-REJ-CYCLE-TRL-VALUE = HIGH-VALUES OR
          TEN99-T05R-REJ-CYCLE-EOF-YES
       PERFORM 5540-REJ-CYCLE-TRAILER-PROCESS
    ELSE
252700***************************************************************** 23730001
252800*   INCREMENT COUNTERS FOR TRAILER TESTING                      * 23740001
252900***************************************************************** 23750001
       ADD 1 TO WS-REJ-CYCLE-TRANS-COUNTER
       PERFORM 5520-REJ-CYCLE-EDIT
    END-IF
    .
EJECT
253500***************************************************************** 23810001
5520-REJ-CYCLE-EDIT.
253700***************************************************************** 23830001
253800*      STRIP OFF THE REJECT KEY AND PROCESS ACCORDING TO        * 23840001
253900*      THE SOURCE CODE.                                         * 23850001
254000***************************************************************** 23860001
    INITIALIZE REJECT-INDICATORS
               WS-T01W-OUTPUT-TRANS-RCD
    MOVE WS-T05R-REJECT-SOURCE-CODE TO WS-T01W-SOURCE-CODE

    EVALUATE TRUE
    WHEN WS-T05R-REJECT-SOURCE-CODE = LIT-MISC-FORM
       MOVE WS-T05R-REJECT-KEY-CHECK-NUM  TO WS-T01W-CHECK-NUM
       MOVE WS-T05R-MISC-FORM-AMT         TO WS-T01W-1099-AMT
       MOVE WS-T05R-REJECT-KEY-CHECK-NUM  TO
            WS-T01W-CHECK-NUM-KEY
       MOVE WS-T05R-MISC-FORM-BRANCH      TO WS-T01W-BRANCH
       MOVE WS-T05R-MISC-FORM-NAME        TO WS-T01W-NAME
       MOVE WS-T05R-MISC-FORM-ADDR-1      TO WS-T01W-ADDR-1
       MOVE WS-T05R-MISC-FORM-ADDR-2      TO WS-T01W-ADDR-2
       MOVE WS-T05R-MISC-FORM-CITY        TO WS-T01W-CITY
       MOVE WS-T05R-MISC-FORM-STATE       TO WS-T01W-STATE
       MOVE WS-T05R-MISC-FORM-POSTCODE    TO WS-T01W-POSTCODE
       MOVE WS-T05R-MISC-FORM-SSN         TO WS-T01W-SSN-US
       MOVE WS-T05R-MISC-FORM-OPER-LOC    TO WS-T01W-OPER-LOC
       MOVE WS-T05R-MISC-FORM-DESCRIPTION TO WS-T01W-COMMENT
       MOVE WS-T05R-MISC-FORM-AMT         TO WS-T01W-TOTAL-AMT
       MOVE WS-T05R-MISC-FORM-AMT         TO WS-T01W-1099-AMT
       MOVE WS-T05R-REJECT-MISC-DETAIL    TO
              WS-T01R-MISC-FORM-RCD

       EVALUATE TRUE
       WHEN WS-T01W-TOTAL-AMT     = LIT-ZERO
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       WHEN WS-T01W-TOTAL-AMT     NOT NUMERIC
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       END-EVALUATE
       ADD  WS-T05R-MISC-FORM-AMT TO
            WS-REJ-CYCLE-TRANS-AMT-ACCUM
       PERFORM 6000-GENERAL-EDIT-PROCESS
       PERFORM 5030-MISC-FORM-WRITE-TRANS-RCD
       PERFORM 7500-REJ-CYCLE-READ-RCD

    WHEN WS-T05R-REJECT-SOURCE-CODE = LIT-BCCW
       MOVE WS-T05R-REJECT-KEY-CHECK-NUM
                                      TO WS-T01W-CHECK-NUM-KEY
       MOVE WS-T05R-REJECT-KEY-TAX-TYPE TO WS-T01W-TAX-TYPE
       MOVE WS-T05R-REJECT-KEY-TIN-IND  TO WS-T01W-TIN-IND
       MOVE WS-T05R-REJECT-DETAIL TO WS-T01W-OUTPUT-DETAIL

       EVALUATE TRUE
       WHEN WS-T01W-TOTAL-AMT = LIT-ZERO
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       WHEN WS-T01W-TOTAL-AMT     NOT NUMERIC
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       END-EVALUATE
       ADD WS-T01W-TOTAL-AMT TO WS-REJ-CYCLE-TRANS-AMT-ACCUM
       PERFORM 6000-GENERAL-EDIT-PROCESS
       PERFORM 6400-1099ENTRY-CODE-SEARCH
       PERFORM 5230-BCCW-WRITE-TRANS-RCD
       PERFORM 7500-REJ-CYCLE-READ-RCD

    WHEN WS-T05R-REJECT-SOURCE-CODE = LIT-DEFT
       MOVE WS-T05R-REJECT-DETAIL TO WS-T01W-OUTPUT-DETAIL
       MOVE WS-T05R-REJECT-KEY-CHECK-NUM TO
                                     WS-T01W-CHECK-NUM-KEY
       EVALUATE TRUE
       WHEN WS-T01W-TOTAL-AMT = LIT-ZERO
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       WHEN WS-T01W-TOTAL-AMT     NOT NUMERIC
          MOVE "Y"        TO REJECT-AMOUNT
          MOVE "Y"        TO REJECT-FLAG

       END-EVALUATE
       ADD WS-T01W-TOTAL-AMT TO WS-REJ-CYCLE-TRANS-AMT-ACCUM
       PERFORM 6000-GENERAL-EDIT-PROCESS
       PERFORM 6400-1099ENTRY-CODE-SEARCH
       PERFORM 5430-DEFT-WRITE-TRANS-RCD
       PERFORM 7500-REJ-CYCLE-READ-RCD

    WHEN OTHER
262600***************************************************************** 24710001
262700*    PROCESS UNKNOWN SOURCE CODE TYPES                          * 24720001
262800***************************************************************** 24730001
       MOVE LIT-UNKWN-SOURCE-CODE-TYPE  TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-T01W-OUTPUT-TRANS-RCD    TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE "Y" TO ERROR-FLAG
       PERFORM 7500-REJ-CYCLE-READ-RCD
    END-EVALUATE
    .
EJECT
263800***************************************************************** 24830001
5540-REJ-CYCLE-TRAILER-PROCESS.
264000***************************************************************** 24850001
264100*      TEST TRAILER TOTALS AND DISPLAY RESULTS                  * 24860001
264200***************************************************************** 24870001
    PERFORM 8999-WRITE-SYSOUT
    PERFORM 8999-WRITE-SYSOUT
    IF WS-REJ-CYCLE-TRANS-COUNTER =
       WS-T05R-REJ-CYCLE-TRL-COUNT AND
       WS-REJ-CYCLE-TRANS-AMT-ACCUM =
       WS-T05R-REJ-CYCLE-TRL-AMT
       MOVE LIT-REJ-CYCLE-SUCCESS  TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-REJ-CYCLE-TRANS-COUNTER TO MSG-FILE-COUNT
       MOVE WS-T05R-REJ-CYCLE-TRL-COUNT TO MSG-TRAILER-COUNT
       MOVE MSG-TRAILER-COUNT-DISPLAY TO
            CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       MOVE WS-REJ-CYCLE-TRANS-AMT-ACCUM TO MSG-FILE-AMOUNT
       MOVE WS-T05R-REJ-CYCLE-TRL-AMT TO MSG-TRAILER-AMOUNT
       MOVE MSG-TRAILER-DOLLAR-DISPLAY TO
            CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 8999-WRITE-SYSOUT
    ELSE
       IF WS-REJ-CYCLE-TRANS-COUNTER NOT EQUAL
          WS-T05R-REJ-CYCLE-TRL-COUNT
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-REJECT-CYCLE-INPUT TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-REJ-CYCLE-TRANS-COUNTER TO MSG-FILE-COUNT
          MOVE WS-T05R-REJ-CYCLE-TRL-COUNT TO MSG-TRAILER-COUNT
          MOVE MSG-TRAILER-COUNT-DISPLAY TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE "Y" TO ERROR-FLAG
       END-IF
       IF WS-REJ-CYCLE-TRANS-AMT-ACCUM NOT EQUAL
          WS-T05R-REJ-CYCLE-TRL-AMT
          MOVE LIT-TRANS-TLS-DO-NOT-AGREE TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE LIT-FOR-REJECT-CYCLE-INPUT TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE WS-REJ-CYCLE-TRANS-AMT-ACCUM TO MSG-FILE-AMOUNT
          MOVE WS-T05R-REJ-CYCLE-TRL-AMT TO MSG-TRAILER-AMOUNT
          MOVE MSG-TRAILER-DOLLAR-DISPLAY TO
               CC-E01W-DISPLAY-RCD
          PERFORM 8999-WRITE-SYSOUT
          MOVE "Y" TO ERROR-FLAG
       END-IF
       PERFORM 8999-WRITE-SYSOUT
    END-IF
    PERFORM 8999-WRITE-SYSOUT
    MOVE LIT-REJ-CYCLE-CONTROL-TOTALS TO CC-E01W-DISPLAY-RCD
    PERFORM 8999-WRITE-SYSOUT
    PERFORM 6600-OUTPUT-BALANCING-PROCESS
    MOVE "Y" TO TEN99-T05R-REJ-CYCLE-EOF
    .
EJECT
270200***************************************************************** 25470001
6000-GENERAL-EDIT-PROCESS.
270400***************************************************************** 25490001
270500*   CHECK FOR FOREIGN TRANSACTIONS                              * 25500001
270600***************************************************************** 25510001
    MOVE "N" TO FOREIGN-INDICATOR
270800***************************************************************** 25530001
270900*   CANADIAN TEST                                               * 25540001
271000***************************************************************** 25550001
    PERFORM 6100-VERIFY-STATE-CODE
    IF WS-US-IND-YES
       CONTINUE
    ELSE
       PERFORM 6200-VERIFY-PROV-CODE
       IF WS-CDN-IND-YES
          MOVE LIT-CDN TO FOREIGN-INDICATOR
       ELSE
          MOVE "Y" TO REJECT-STATE
          MOVE "Y" TO REJECT-FLAG
       END-IF
    END-IF
272300***************************************************************** 25680001
272400*   CANADIAN TEST                                               * 25690001
272500***************************************************************** 25700001
    IF CANADIAN-OP-LOC
        MOVE LIT-CDN TO FOREIGN-INDICATOR
    END-IF
272900***************************************************************** 25740001
273000*   PUERTO RICO TEST                                            * 25750001
273100***************************************************************** 25760001
    IF WS-T01W-BRANCH-CODE = LIT-TW OR
       WS-T01W-STATE       = LIT-PR-STATE-CODE
       MOVE LIT-PR TO FOREIGN-INDICATOR
    END-IF

    IF FOREIGN-INDICATOR-NO
       PERFORM 6010-DOMESTIC-EDIT-PROCESS
    END-IF
    .
EJECT
274200***************************************************************** 25870001
6010-DOMESTIC-EDIT-PROCESS.
274400***************************************************************** 25890001
274500*   EDITS COMMON TO ALL FILES                                   * 25900001
274600*   POSTAL CODE TEST                                            * 25910001
274700***************************************************************** 25920001
    IF WS-T01W-POSTCODE = SPACES
       MOVE "Y" TO REJECT-POSTCODE
       MOVE "Y" TO REJECT-FLAG
    END-IF

275300***************************************************************** 25980001
275400*   NAME TEST                                                   * 25990001
275500***************************************************************** 26000001
    IF WS-T01W-NAME = SPACES
       MOVE "Y" TO REJECT-NAME
       MOVE "Y" TO REJECT-FLAG
    END-IF

276100***************************************************************** 26060001
276200*   SOCIAL SECURITY NUMBER TEST FOR ALPHABETIC CHARACTERS       * 26070001
276300*   AND SPACES (WILL ALSO BE CAUGHT IN THIS TEST)               * 26080001
276400***************************************************************** 26090001
    IF WS-T01W-SSN-US IS NUMERIC
       CONTINUE
    ELSE
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    END-IF

277200***************************************************************** 26170001
277300*   SOCIAL SECURITY NUMBER TEST FOR VALID NUMBER                * 26180001
277400***************************************************************** 26190001
    IF ALL-ONES
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-TWOS
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-THREES
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-FOURS
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-FIVES
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-SIXES
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-SEVENS
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-EIGHTS
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

    IF ALL-NINES
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    ELSE
       CONTINUE
    END-IF

283800***************************************************************** 26830001
283900*   SOCIAL SECURITY NUMBER TEST FOR ZERO SSN                    * 26840001
284000***************************************************************** 26850001
    IF WS-T01W-SSN-US = LIT-ZERO-SSN
       MOVE "Y" TO REJECT-SSN
       MOVE "Y" TO REJECT-FLAG
    END-IF

284600***************************************************************** 26910001
284700*   ADDRESS TEST                                                * 26920001
284800***************************************************************** 26930001
    IF WS-T01W-ADDR-1 = SPACES
       MOVE "Y" TO REJECT-ADDRESS
       MOVE "Y" TO REJECT-FLAG
       MOVE LIT-GEN-DEL TO WS-T01W-ADDR-1
    END-IF

285500***************************************************************** 27000001
285600*   CITY TEST                                                   * 27010001
285700***************************************************************** 27020001
    IF WS-T01W-CITY = SPACES
       MOVE "Y" TO REJECT-CITY
       MOVE "Y" TO REJECT-FLAG
    END-IF
    .
EJECT
286400***************************************************************** 27090001
6100-VERIFY-STATE-CODE.
286600***************************************************************** 27110001
286700*       SEARCH STATE TABLE TO CONVERT STATE CODE IF NUMERIC AND * 27120001
286800*          VERIFY THAT THE STATE CODE IS ON THE TABLE           * 27130001
286900*       SEARCH STATE TABLE TO VERIFY STATE CODE IF ALPHA IS     * 27140001
287000*          CONTAINED ON THE TABLE.                              * 27150001
287100***************************************************************** 27160001
    IF WS-T01W-STATE IS NUMERIC
       SEARCH ALL STBL-STATE-TABLE-R
       AT END
          MOVE "N" TO WS-US-IND
       WHEN STBL-STATE-CODE-N(STATE-INDX) = WS-T01W-STATE
          MOVE STBL-STATE-CODE-A(STATE-INDX) TO WS-T01W-STATE
          MOVE "Y" TO WS-US-IND
       END-SEARCH
    ELSE
       SEARCH ALL STBL-STATE-TABLE-RX
       AT END
          MOVE "N" TO WS-US-IND
       WHEN STBL-STATE-CODE-AX(STATE-INDX-X) = WS-T01W-STATE
          MOVE "Y" TO WS-US-IND
       END-SEARCH
    END-IF
    .
EJECT
289000***************************************************************** 27350001
6200-VERIFY-PROV-CODE.
289200***************************************************************** 27370001
289300*       SEARCH PROV TABLE TO CONVERT PROV CODE IF NUMERIC AND   * 27380001
289400*          VERIFY THAT THE PROV CODE IS ON THE TABLE            * 27390001
289500*       SEARCH PROV TABLE TO VERIFY PROV CODE IF ALPHA IS       * 27400001
289600*          CONTAINED ON THE TABLE.                              * 27410001
289700***************************************************************** 27420001
    IF WS-T01W-STATE IS NUMERIC
       SEARCH ALL STBL-PROV-TABLE-R
       AT END
          MOVE "N" TO WS-CDN-IND
       WHEN STBL-PROV-CODE-N(PROV-INDX) = WS-T01W-STATE
          MOVE STBL-PROV-CODE-A(PROV-INDX) TO WS-T01W-STATE
          MOVE "Y" TO WS-CDN-IND
       END-SEARCH
    ELSE
       SEARCH ALL STBL-PROV-TABLE-RX
       AT END
          MOVE "N" TO WS-CDN-IND
       WHEN STBL-PROV-CODE-AX(PROV-INDX-X) = WS-T01W-STATE
          MOVE "Y" TO WS-CDN-IND
       END-SEARCH
    END-IF
    .
EJECT
291600***************************************************************** 27610001
6400-1099ENTRY-CODE-SEARCH.
291800***************************************************************** 27630001
291900*    PERFORM CODE SEARCH                                        * 27640001
292000***************************************************************** 27650001
    IF DISB-INDEX < 6
    SET CODE-INDEX TO 1
    SEARCH WS-T07R-1099ENTRY-CODES
    AT END
       MOVE SPACES TO WS-T01W-DIST-1099-INDIC(DISB-INDEX)
    WHEN WS-T01W-DIST-COMPASS-CODE(DISB-INDEX) =
          WS-T07R-1099ENTRY-CODE(CODE-INDEX)
       MOVE "Y" TO WS-T01W-DIST-1099-INDIC(DISB-INDEX)
292900*****   ADD WS-T01W-DIST-AMT(DISB-INDEX) TO WS-T01W-1099-AMT      27740001
    END-SEARCH
    ADD WS-T01W-DIST-AMT(DISB-INDEX) TO WS-TRANS-AMT-ACCUM
    SET DISB-INDEX UP BY 1
    END-IF
    .
EJECT
293600***************************************************************** 27810001
6500-INITIAL-OUTPUT-COUNT.
293800***************************************************************** 27830001
293900*    INITIALIZE OUTPUT COUNTERS                                 * 27840001
294000***************************************************************** 27850001
     INITIALIZE WS-OUTPUT-TRANS-CNT
                WS-OUTPUT-TRANS-AMT
                WS-FOR-TRANS-CNT
                WS-FOR-TRANS-AMT
                WS-REJ-TRANS-CNT
                WS-REJ-TRANS-AMT
                WS-EXCLUDES-TRANS-CNT
                WS-EXCLUDES-TRANS-AMT
     .
EJECT
295100***************************************************************** 27960001
6600-OUTPUT-BALANCING-PROCESS.
295300***************************************************************** 27980001
295400*    DISPLAY CONTROL TOTALS FOR ALL OUTPUTS                     * 27990001
295500***************************************************************** 28000001
     MOVE WS-OUTPUT-TRANS-CNT TO MSG-NUM-RCDS
     MOVE LIT-TRANS-FILE      TO MSG-OUTPUT-FILE-NAME
     MOVE WS-OUTPUT-TRANS-AMT TO MSG-AMOUNT
     MOVE MSG-CONTROL-TOTALS  TO CC-E01W-DISPLAY-RCD
     PERFORM 8999-WRITE-SYSOUT

     MOVE WS-FOR-TRANS-CNT    TO MSG-NUM-RCDS
     MOVE LIT-FOREIGN-FILE    TO MSG-OUTPUT-FILE-NAME
     MOVE WS-FOR-TRANS-AMT    TO MSG-AMOUNT
     MOVE MSG-CONTROL-TOTALS  TO CC-E01W-DISPLAY-RCD
     PERFORM 8999-WRITE-SYSOUT

     MOVE WS-REJ-TRANS-CNT    TO MSG-NUM-RCDS
     MOVE LIT-REJECT-FILE     TO MSG-OUTPUT-FILE-NAME
     MOVE WS-REJ-TRANS-AMT    TO MSG-AMOUNT
     MOVE MSG-CONTROL-TOTALS  TO CC-E01W-DISPLAY-RCD
     PERFORM 8999-WRITE-SYSOUT

     MOVE WS-EXCLUDES-TRANS-CNT TO MSG-NUM-RCDS
     MOVE LIT-EXCLUDES-FILE     TO MSG-OUTPUT-FILE-NAME
     MOVE WS-EXCLUDES-TRANS-AMT TO MSG-AMOUNT
     MOVE MSG-CONTROL-TOTALS    TO CC-E01W-DISPLAY-RCD
     PERFORM 8999-WRITE-SYSOUT
     .
EJECT
298100***************************************************************** 28260001
7000-MISC-FORM-READ-RCD.
298300***************************************************************** 28280001
298400*      READ ROUTINE FOR ALL MISC FORM FILE READS                * 28290001
298500***************************************************************** 28300001
    INITIALIZE WS-T01R-MISC-FORM-RCD
    READ TEN99-T01R-MISC-TRANS-FILE INTO
         WS-T01R-MISC-FORM-RCD
       AT END
       MOVE "Y" TO TEN99-T01R-MISC-FORM-EOF
    END-READ
    .
EJECT
299400***************************************************************** 28390001
7200-BCCW-READ-RCD.
299600***************************************************************** 28410001
299700*      READ ROUTINE FOR B&CCW ISSUES                            * 28420001
299800***************************************************************** 28430001
    INITIALIZE WS-T03R-BCCW-RCD
    READ TEN99-T03R-BCCW-FILE         INTO WS-T03R-BCCW-RCD
       AT END
       MOVE "Y" TO TEN99-T03R-BCCW-EOF
    END-READ
    EVALUATE TRUE
    WHEN WS-T03R-BCCW-HDR-VALUE = LOW-VALUES
       CONTINUE
    WHEN WS-T03R-BCCW-HDR-VALUE = HIGH-VALUES
       MOVE "Y" TO END-OF-BCCW-DETAIL
    WHEN OTHER
       MOVE "Y" TO END-OF-BCCW-HEADERS
    END-EVALUATE
    .
EJECT
301400***************************************************************** 28590001
7300-DEFT-READ-RCD.
301600***************************************************************** 28610001
301700*      READ ROUTINE FOR DEFT  ISSUES                            * 28620001
301800***************************************************************** 28630001
    INITIALIZE WS-T04R-DEFT-RCD

    READ TEN99-T04R-DEFT-FILE         INTO WS-T04R-DEFT-RCD
       AT END
       MOVE "Y" TO TEN99-T04R-DEFT-EOF
    END-READ

    EVALUATE TRUE
    WHEN WS-T04R-DEFT-HDR-VALUE = LOW-VALUES
       CONTINUE
    WHEN WS-T04R-DEFT-HDR-VALUE = HIGH-VALUES
       MOVE "Y" TO END-OF-DEFT-DETAIL
    WHEN OTHER
       MOVE "Y" TO END-OF-DEFT-HEADERS
    END-EVALUATE
    .
EJECT
303600***************************************************************** 28810001
7500-REJ-CYCLE-READ-RCD.
303800***************************************************************** 28830001
303900*      READ ROUTINE FOR ALL MISC FORM FILE READS                * 28840001
304000***************************************************************** 28850001
    INITIALIZE WS-T05R-REJECT-RECYCLING-RCD
    READ TEN99-T05R-REJ-CYCLE-FILE INTO
            WS-T05R-REJECT-RECYCLING-RCD
       AT END
       MOVE "Y" TO TEN99-T05R-REJ-CYCLE-EOF
    END-READ
    .
EJECT
304900***************************************************************** 28940001
7900-READ-CONTROL-CARD-IN.
305100***************************************************************** 28960001
305200*      READ ROUTINE FOR CONTROL CARD                            * 28970001
305300***************************************************************** 28980001
    READ CC-R01R-CONTROL-CARD INTO CONTROL-CARD-IN1
        AT END
           MOVE "Y" TO EOF-CONTROL-CARD
    END-READ
    IF EOF-CONTROL-CARD-YES
       MOVE LIT-NO-CONTROL-CARD TO SAR-PARAGRAPH
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 9998-COREDUMP
    END-IF
    .
EJECT
306500***************************************************************** 29100001
7910-READ-1099ENTRY-TABLE.
306700***************************************************************** 29120001
306800*      READ ROUTINE FOR 1099 REPORTABLE ENTRY CODE TABLE        * 29130001
306900***************************************************************** 29140001
    READ WS-T07R-1099ENTRY-CD-FILE INTO
         WS-T07R-1099ENTRY-CODES(CODE-INDEX)
        AT END
           MOVE "Y" TO EOF-1099ENTRY-TABLE
    END-READ
    IF WS-T07R-1099ENTRY-CODE (CODE-INDEX) = HIGH-VALUES
       SET CODE-INDEX TO LIT-NUM-OF-1099-CODES
    END-IF
    IF EOF-1099ENTRY-TABLE-YES
       MOVE LIT-NO-1099ENTRY-TABLE TO SAR-PARAGRAPH
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 9998-COREDUMP
    END-IF
    .
EJECT
308500***************************************************************** 29270001
8000-WRITE-HEADERS.
308700***************************************************************** 29290001
308800*      WRITE HEADER RECORDS FOR ALL OUTPUT FILES.               * 29300001
308900***************************************************************** 29310001
    WRITE TEN99-T01W-TRANS-OUTPUT-RCD
          FROM WS-T01W-OUTPUT-TRANS-HDR
    WRITE TEN99-T02W-REJ-CYCLE-OUT-RCD
          FROM WS-T02W-REJECT-RECYCLING-HDR
    WRITE TEN99-T03W-FOREIGN-OUTPUT-RCD
          FROM WS-T03W-FOR-OUTPUT-HDR
    WRITE TEN99-T04W-EXCLUDES-RCD
          FROM WS-T04W-EXCLUDES-HDR
    WRITE TEN99-C01W-REJ-RPT-OUTPUT-RCD
          FROM WS-C01W-REJ-RPT-OUTPUT-HDR
    .
EJECT
310200***************************************************************** 29440001
8010-WRITE-TRANS-RCD.
310400***************************************************************** 29460001
310500*      WRITE TRANSACTION FOR RECORD PASSING ALL EDITS           * 29470001
310600***************************************************************** 29480001
    ADD LIT-1 TO WS-TOTAL-OUTPUT-TRANS-CNT
    ADD LIT-1 TO WS-OUTPUT-TRANS-CNT
    ADD WS-T01W-TOTAL-AMT TO WS-TOTAL-OUTPUT-TRANS-AMT
    ADD WS-T01W-TOTAL-AMT TO WS-OUTPUT-TRANS-AMT
    MOVE LIT-A TO WS-T01W-TRANSACTION-INDICATOR
    WRITE TEN99-T01W-TRANS-OUTPUT-RCD
          FROM WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE REJECT-INDICATORS
    .
EJECT
311800***************************************************************** 29600001
8020-WRITE-REJECT-TRANS-RCD.
312000***************************************************************** 29620001
312100*      WRITE REJECT FILE FOR RECORD NOT PASSING ALL EDITS       * 29630001
312200***************************************************************** 29640001
    ADD LIT-1 TO WS-TOTAL-REJ-TRANS-CNT
    ADD LIT-1 TO WS-REJ-TRANS-CNT
    ADD LIT-1 TO WS-TOTAL-REJ-RPT-TRANS-CNT
    ADD WS-T01W-TOTAL-AMT TO WS-TOTAL-REJ-TRANS-AMT
    ADD WS-T01W-TOTAL-AMT TO WS-REJ-TRANS-AMT
    ADD WS-T01W-TOTAL-AMT TO WS-TOTAL-REJ-RPT-TRANS-AMT
    WRITE TEN99-T02W-REJ-CYCLE-OUT-RCD
       FROM WS-T02W-REJECT-RECYCLING-RCD
    .
EJECT
313300***************************************************************** 29750001
8030-WRITE-REJECT-REPORT-RCD.
313500***************************************************************** 29770001
313600*      WRITE REJECT FILE TO BE USED AS INPUT FOR REPORTS        * 29780001
313700***************************************************************** 29790001
    MOVE REJECT-INDICATORS TO WS-C01W-REJ-RPT-REJECT-CODES
    WRITE TEN99-C01W-REJ-RPT-OUTPUT-RCD
       FROM WS-C01W-REJ-RPT-OUTPUT-RCD
    INITIALIZE WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE REJECT-INDICATORS
    .
EJECT
314500***************************************************************** 29870001
8040-WRITE-FOR-TRANS-RCD.
314700***************************************************************** 29890001
314800*      WRITE FOREIGN TRANSACTION RECORD                         * 29900001
314900***************************************************************** 29910001
    ADD LIT-1 TO WS-TOTAL-FOR-TRANS-CNT
                 WS-FOR-TRANS-CNT
    ADD WS-T01W-TOTAL-AMT TO WS-TOTAL-FOR-TRANS-AMT
    ADD WS-T01W-TOTAL-AMT TO WS-FOR-TRANS-AMT
    WRITE TEN99-T03W-FOREIGN-OUTPUT-RCD
          FROM WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE REJECT-INDICATORS
    .
EJECT
316000***************************************************************** 30020001
8050-WRITE-EXCLUDES-RCD.
316200***************************************************************** 30040001
316300*      WRITE EXCLUDED TRANSACTION RECORDS                       * 30050001
316400*      SOCIAL SECURITY NUMBER OR TRANS WITH $0 1099 REPORTABLE  * 30060001
316500*      AMOUNT.                                                  * 30070001
316600***************************************************************** 30080001
    ADD LIT-1 TO WS-TOTAL-EXCLUDES-TRANS-CNT
    ADD LIT-1 TO WS-EXCLUDES-TRANS-CNT
    ADD WS-T01W-TOTAL-AMT TO WS-TOTAL-EXCLUDES-TRANS-AMT
    ADD WS-T01W-TOTAL-AMT TO WS-EXCLUDES-TRANS-AMT
    WRITE TEN99-T04W-EXCLUDES-RCD
          FROM WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE WS-T01W-OUTPUT-TRANS-RCD
    INITIALIZE REJECT-INDICATORS
    .
EJECT
317700*8999-WRITE-SYSOUT.                                               30190001
317800***************************************************************** 30200001
317900*    ++INCLUDE C2INZ002                                         * 30210001
318000*      COMMON PARAGRAPH TO WRITE A SYSOUT RECORD                * 30220001
318100*  8999-WRITE-SYSOUT.                                           * 30230001
318200***************************************************************** 30240001
COPY C2INZ002.
EJECT
9000-TERMINATION-ROUTINE.
318600***************************************************************** 30280001
318700*      CHECK FOR PROCESSING ERROR FLAG SET TO "Y".              * 30290001
318800*      PREPARE THE TRAILER REOCRD FOR EACH OUTPUT FILE.         * 30300001
318900*      PREPARE GRAND TOTALS.                                    * 30310001
319000***************************************************************** 30320001
    IF ERROR-FLAG = "Y"
       PERFORM 9998-COREDUMP
    ELSE
       INITIALIZE          WS-T01W-OUTPUT-TRANS-RCD
                           WS-T02W-REJECT-RECYCLING-RCD
                           WS-T03W-FOR-OUTPUT-RCD
                           WS-T04W-EXCLUDES-OUTPUT-RCD
                           WS-C01W-REJ-RPT-OUTPUT-RCD
       MOVE     HIGH-VALUES  TO WS-T01W-OUTPUT-TRL-VALUE
                                WS-T02W-REJECT-TRL-VALUE
                                WS-T03W-FOR-TRL-VALUE
                                WS-T04W-EXCLUDES-VALUE
                                WS-C01W-REJ-RPT-TRL-VALUE
       MOVE WS-TOTAL-OUTPUT-TRANS-CNT TO WS-T01W-OUTPUT-TRL-CNT
       MOVE WS-TOTAL-OUTPUT-TRANS-AMT TO WS-T01W-OUTPUT-TRL-AMT
       MOVE WS-TOTAL-REJ-TRANS-CNT    TO WS-T02W-REJECT-TRL-CNT
       MOVE WS-TOTAL-REJ-TRANS-AMT    TO WS-T02W-REJECT-TRL-AMT
       MOVE WS-TOTAL-REJ-RPT-TRANS-CNT TO
            WS-C01W-REJ-RPT-TRL-CNT
       MOVE WS-TOTAL-REJ-RPT-TRANS-AMT TO
            WS-C01W-REJ-RPT-TRL-AMT
       MOVE WS-TOTAL-FOR-TRANS-CNT    TO WS-T03W-FOR-TRL-CNT
       MOVE WS-TOTAL-FOR-TRANS-AMT    TO WS-T03W-FOR-TRL-AMT
       MOVE WS-TOTAL-EXCLUDES-TRANS-CNT TO
                  WS-T04W-EXCLUDES-CNT
       MOVE WS-TOTAL-EXCLUDES-TRANS-AMT TO
                  WS-T04W-EXCLUDES-AMT
321800***************************************************************** 30600001
321900*      WRITE TRAILER RECORDS FOR ALL OUTPUT FILES.              * 30610001
322000***************************************************************** 30620001
    WRITE TEN99-T01W-TRANS-OUTPUT-RCD
          FROM WS-T01W-OUTPUT-TRANS-TRL
    WRITE TEN99-T02W-REJ-CYCLE-OUT-RCD
          FROM WS-T02W-REJECT-RECYCLING-TRL
    WRITE TEN99-T03W-FOREIGN-OUTPUT-RCD
          FROM WS-T03W-FOR-OUTPUT-TRL
    WRITE TEN99-T04W-EXCLUDES-RCD
          FROM WS-T04W-EXCLUDES-TRL
    WRITE TEN99-C01W-REJ-RPT-OUTPUT-RCD
          FROM WS-C01W-REJ-RPT-OUTPUT-TRL
323100***************************************************************** 30730001
323200*  MOVE TOTALS FOR GRAND TOTAL DISPLAY                          * 30740001
323300***************************************************************** 30750001
       MOVE WS-TOTAL-OUTPUT-TRANS-CNT TO WS-OUTPUT-TRANS-CNT
       MOVE WS-TOTAL-OUTPUT-TRANS-AMT TO WS-OUTPUT-TRANS-AMT
       MOVE WS-TOTAL-REJ-TRANS-CNT    TO WS-REJ-TRANS-CNT
       MOVE WS-TOTAL-REJ-TRANS-AMT    TO WS-REJ-TRANS-AMT
       MOVE WS-TOTAL-FOR-TRANS-AMT    TO WS-FOR-TRANS-AMT
       MOVE WS-TOTAL-FOR-TRANS-CNT    TO WS-FOR-TRANS-CNT
       MOVE WS-TOTAL-EXCLUDES-TRANS-CNT TO
                  WS-EXCLUDES-TRANS-CNT
       MOVE WS-TOTAL-EXCLUDES-TRANS-AMT TO
                  WS-EXCLUDES-TRANS-AMT
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 8999-WRITE-SYSOUT
       MOVE LIT-GRAND-TOTAL TO CC-E01W-DISPLAY-RCD
       PERFORM 8999-WRITE-SYSOUT
       PERFORM 6600-OUTPUT-BALANCING-PROCESS
    END-IF
    PERFORM 9010-ENDING-SYSOUT-MESSAGES
    PERFORM 9999-CLOSE-FILES
    .
EJECT
9010-ENDING-SYSOUT-MESSAGES.
325500***************************************************************** 30970001
325600*    ++INCLUDE C2INZ003                                         * 30980001
325700*      COMMON ENDING SYSOUT MESSAGES                            * 30990001
325800***************************************************************** 31000001

COPY C2INZ003.

EJECT
326300*9998-COREDUMP.                                                   31050001
326400***************************************************************** 31060001
326500*    ++INCLUDE C2INZ004                                         * 31070001
326600*      COMMON ABEND INFORMATION PARAGRAPH                       * 31080001
326700*      9998-COREDUMP                                            * 31090001
326800***************************************************************** 31100001
COPY C2INZ004.

EJECT
327200*9999-CLOSE-FILES.                                                31140001
327300***************************************************************** 31150001
327400*    ++INCLUDE C2INZ005                                         * 31160001
327500*      COMMON CLOSE FILES PARAGRAPH                             * 31170001
327600*      PERFORM 9999-CLOSE-FILES                                 * 31180001
327700***************************************************************** 31190001
COPY C2INZ005.
    CLOSE
          TEN99-T01R-MISC-TRANS-FILE
          TEN99-T03R-BCCW-FILE
          TEN99-T04R-DEFT-FILE
          TEN99-T05R-REJ-CYCLE-FILE
          WS-T07R-1099ENTRY-CD-FILE
          CC-R01R-CONTROL-CARD
          TEN99-T01W-TRANS-OUTPUT-FILE
          TEN99-T02W-REJ-CYCLE-OUT-FILE
          TEN99-C01W-REJ-RPT-OUTPUT-FILE
          TEN99-T03W-FOREIGN-OUTPUT-FILE
          TEN99-T04W-EXCLUDES-FILE
          .
329200***************************************************************** 31340001
329300*   END PROGRAM CCAC6320                                        * 31350001
329400***************************************************************** 31360001

